[
{"town": "Ampara", "place": "Pannathgoda Purana Raja Maha Viharaya", "description": "Claimed to be a construction of King Saddatissa during his time in the Eastern province as its ruler Pannathgoda Purana Raja Maha Viharaya is an ancient temple situated in Dewallahinda near Pallanoya.Situated atop a small hillock the temple consist the ruins of an ancient pagoda while an old devlaya too is found on site. Yet the most intriguing is the rock carved map of Sri Lanka found during the excavations. The map is a correct representation of country’s shape although the exact date of its creation is unknown.Things To Do: Archeology, pilgrimage and photography"},
{"town": "Colombo", "place": "Arcade Independence Square", "description": "The Arcade Independence Square is a shopping complex.In the Auditor General's building (where you can see the enormous clock tower of Independence Square), you get the Wickramarachchi opticians if you are looking for a pair of good sunglasses, Stone and String, a Complete set of Kookabura equipment (for All Your Cricket Frenzy Molecules), a Titan showroom and charming local tea, Kaema Sutra and jewelry in Sri Lanka. There is even a living room on the first floor, called the Wax Museum, and a 3D Cineplex movie.For the cheapest, on the ground floor, there are a whole lot of other places to go, including Burger King and the food court that has Paan Paan and Tropical Juice Bar among its stands Short courses are fairly reasonable). There is an unexpectedly Japanese place called Tsukui Uoichi in the former Auditor General's building. Also in a corner building that is old and yellowing on the same premises, there is a small canteen that sells rice and short-eats.Not only that Arcade Independence Square is an incredible place to relax: you can take a good breath in here. the outside is with beautiful flowers and green grass, a smooth pavement and cane furniture, and the inside is entirely made of white wood panels. Some corridors have long benches where you can just sit and relax, there are great views of the lawn, a walk-over fish tanks and imposing lion stone caving are amazing experiences. In the Independence Square through various windows of the building, and there is a dormer window Very nice in the center of one of the stairs.This latest shopping precinct is situated in Borella (30, Bauddhaloka Mawatha, Colombo 7), near to BMICH. Arcade Independence Square is open from 7.00 am to 11.00 pm. Not only that this place is most beautiful in the evening, because of colorful lights."},
{"town": "Kalutara", "place": "Richmond Castle", "description": "The mansion was built in from 1900 to 1910 with a mixture of eastern and westerns architectural lines.This Place is one of the most spectacular architectural works of the period. Richmond Castle was owned by a rich landowner turned philanthropist, Padikara Mudali Nanayakkara Rajawasala Appuhamilage Don Arthur of Silva Wijesinghe Siriwardena.Richmond Castle is a two-storey building with 99 doors and 34 windows, adorned with delicately designed glass panels portraying vines. Records indicate that two shiploads of teak were imported from Burma for their construction.The whole building is characterized by complex sculptures. The wood remains as fresh as when it was built. A dance hall with a stage is another of its characteristics. The architecture shows a greater similarity with an English manor than by an old walauwwa.The gardens that once boasted a richness of flowers have currently given thanks to trees like coconut, mangosteen, veralu, guava, mango, rambutan and various citrus fruits. The mudaliyar was a lover of nature and adorned his garden with marble statues, some of which remain standing. However, he was not happy in marriage, because they had not children. Having finished his marriage, he bequeathed his property to the Public Trustee for the well-being of the country's children.The house sits on a hill 2 km from the Kalutara, adjoining the Kalu Ganga River at Palatota.Once a circuit home for high positioning officers of the British regulatory administration, today it is a famous tourist destination, and fills in as an instructive community for less advantaged offspring of Kalutara and the region."},
{"town": "Ampara", "place": "Alioluwa Lake", "description": "Alioluwa wewa or the reservoir of elephant head is a reservoir connected to the Inginiyagala Senanayaka Samudra. Formerly known as the “Ali gal ge wewa’, the lake shows as strange similarity to the head of an elephant, thus named alioluwa.Other than its unique shape of the Lake, the water channel which conveys water from the Senanayake Samudraya of Inginiyagala to the lake too is famed for its unique position for being a water channel which flows over the Namal Oya.The channel flows over the Namal Oya near Inginiyagalacreating a cross connection of water ways rare and beautiful and attracts locals and tourists for bathing and sightseeing.Elephants of Galoya valley too flock to the Alioluwa Lake during the evenings in search of water and fresh grass which grows on its banks.Things to do: Sightseeing and photography"},
{"town": "Colombo", "place": "Pettah Floating Market", "description": "This floating market has many trade stalls selling various products including clothing items, shoes, jewelries, bags and accessories, electronic items, toys, fruits and vegetables. There is a food court with snacks and soft drinks. Floating Market is best place to relax and enjoy.This place is closer to fort railway station and pettah bus stand."},
{"town": "Bandarawela", "place": "Ella", "description": "The area has a rich bio-diversity, dense with numerous varieties of flora and fauna. Ella is surrounded by hills covered with cloud forests and tea plantations. The town has a cooler climate than surrounding lowlands, due to its elevation. The Ella Gap allows views across the southern plains of Sri Lanka. On a sunny morning, you can even see the glow from the lighthouses along the southern coast.By rail. Ella's a few stops from Badulla at the end of the railway line that snakes through the Hill Country. Trains go to Colombo and Kandy from here. The fares are ludicrously cheap in 2nd and 3rd class, and the views spectacular. It's usually no problem getting a seat in 2nd/3rd class going to Colombo or Kandy, as the trains from Badulla are quite empty until reaching Nanu Oya. However the reverse is true going up to Ella and it can be quite crowded until the last 2 or 3 hours of the journey. Ella's railway station itself is prettily quaint. there are many travelers who visit ella by train.By Road, Buses go south through Ella Gap to Wellawaya where you can change for a number of destinations in the south of the island.The climate throughout most of the year is typical of the high Hill Country, with a hot sun by midday, but a moderate air temperature. It will often rain in the afternoon, but only for an hour or so. A sweatshirt, or light jacket is needed at night. In December it can rain a lot!.Ella has a small post office and one bank (Bank of Ceylon) with an ATM.There's not much to do in Ella itself, with a handful of small shops and only a few bars/restaurants. It's basically a nicely relaxing base for exploring the surrounding country."},
{"town": "Ampara", "place": "Maduru Oya Reservoir", "description": "A seemingly endless body of water stretching to 6400 hectares restricted by a dam crest 150 meters tall, Maduru Oya reservoir is a majestic sight with a towering Buddha statue and a dry zone jungle rising in the background.Constructed in 1981 under the accelerated Mahaweli Scheme Maduru Oya has a history of feeding many an irrigation project in the area even in the ancient times. King Mahasen had constructed Mahadaragalla Tank damming the Maduru Oya while the clearance of the jungle around for the construction revealed an ancient sluicegate estimated to have been built before the first century BC and the recorded history of the country.Standing 23 meters high, Maduru Oya ancient sluice possesses some salient features compared to other sluices found in ancient irrigation including its twin inlet conduits dressed with stone slabs enclosed in corbelled arch shaped brickwork. The source of this sophisticated hydraulic engineering work is not known up to today but is generally believed to be of a civilization predating the arrival of King Vijaya from India.Today Maduru Oya provides precious irrigation water to the area lying along the left bank of the Maduru Oya River, has increased agricultural production, generates employment opportunities, develop the hydropower potential, and had provided resettlements for landless poor estimated at about 35,000 families.The animal population, especially the elephants too benefits from the project with flocks gathering to the reservoir. A whole herd could be spotted scattered about in the distance, grazing quietly with their inherent lazy elegance. Nearly 150 elephants roam the Maduru Oya National Park, the catchment of the Maduru Oya reservoir.In the distance the NDK Reservoir could be spotted implying that once upon a time both these reservoirs would have stood as one and the valley then would have submerged. The best time to visit the reservoir is during the evening, when sunsets on the horizon, however accommodation in and around the reservoir is harder to find the available being more often over booked and overpriced.Things To Do: Photography, sightseeing, elephant watching, hiking"},
{"town": "Beruwala", "place": "Beruwala Light House", "description": "Beruwala Lighthouse is a lighthouse located on Barberyn Island. Three-quarters of this island are covered with coconut palms, Plumeria flowers, mango and cashew nuts, and buffalo shade. Exotic birds, reptiles and insects roam the island and you can an instant connection with nature.A 10-minute boat ride from the town of Beruwala you can go to Barberyn island, a place no hustle and bustle of people, cars and traffic.Barberyn Island an 8 acres island situated 0.8 km offshore from the town of Beruwala on the south-west coast of Sri Lanka, 56 km south of Colombo. The lighthouse is a 112-ft. high round white conical granite tower.The lighthouse was completed in November 1889, and operated by the Imperial Lighthouse Service. In 1969 it was upgraded with the replacement of the old dioptric apparatus and with a pedestal rotating beacon (Pharos Marine PRB-21 sealed beam optic and drive pedestal). It was further modernized in 2000, with the introduction of a Differential Global Positioning System (DGPS) and is computer linked to the other major lighthouses around the country. The Beruwala Lighthouse is one of the four international lighthouses in Sri Lanka."},
{"town": "Ratnapura", "place": "Udawalawe National Park", "description": "Udawalawe is undoubtedly the best place in Sri Lanka to see wild Asian Elephants throughout the year: there are about 500 elephants in the park and they often roam in herds of up to 100. Udawalawe National Park is unique in terms of consistency in numbers of elephants roaming the park: it has no a seasonal variation in herds of elephants. The best hours to visit the park are in the mornings and evenings. Late evening also affords the photographic opportunities in the backdrop of loveliest sunsets. Udawalawe has rich biodiversity. There are so many Species recorded from the park include 94 plants, 21 fish, 12 amphibians, 33 reptiles, 184 birds (33 of which are migratory), and 43 mammals. Additionally, 135 species of butterflies are among the invertebrates found in Udawalawe.Udawalawe lies on the boundary of Sri Lanka's wet and dry zones. Plains dominate the topography, though there are also some mountainous areas. The Kalthota Range and Diyawini Falls are in the north of the park and the outcrops of Bambaragala and Reminikotha lie within it. The habitat surrounding at the reservoir includes marshes, the Walawe river and its tributaries, forests and grasslands. In the six months ending in August 2009, the park earned revenue of Rs. 18.2 million. From 1994 to 2001 some 423,000 people visited the park, 20% of them foreigners. For the 1998-2001 period, average annual revenue was US$280,000. Postage stamps bearing the images of four wild animals of Udawalawe were issued on 31 October 2007 in the series \"National Parks of Sri Lanka\", featuring water buffalo, Sri Lankan elephant, ruddy mongoose and tufted grey langur."},
{"town": "Hambantota", "place": "Kirinda", "description": "According to legends, some believe that Kirinda is the place where prince Vihara Maha Devi drifted to shore. King Kelanithissa, who ruled Kelaniya, was the father of Prince Viharamahadevi.In the second century, there was a growing sea-level situation (possibly the first recorded tsunami in Sri Lanka) in Kelaniya. People thought this was due to the sin committed by King Kelanithissa in order to kill a monk.To change this sin, he was asked to sacrifice his daughter, the princes Vihara Maha Devi by putting her down.After landing in the Kirinda region, King Kawanthissa, who ruled in the kingdom of Ruhunu, welcomed her and then married. It is believed that the Lahugala Magul Maha Viharaya was built on the site, where their marriage took place.This temple on the rock gives you to magnificent view of the Indian ocean and other surrounding things.This Kirinda Beach and the Temple located in kirinda village hambanthota. You can reach to kirinda, Tissamaharama- Kirinda Road by bus or taxi.From Colombo to kirinda, it will take 4 hours."},
{"town": "Ampara", "place": "Buddhangala Monastery", "description": "Hidden among a thick jungle full of wild elephants and leopards is the Buddangalamonastery, a Buddhist meditation Centre, which is nearly 2300 years old.Established in the second century BC by a provincial Princess named, Chitra;the ruins of a once thriving temple and monastery is found scattered over an area of 200 acres within the jungle. The standing ruins spreading across five rocky mountains scattered with ponds tells the story of a vast hermitage in the days gone by when Ampara was a flourishing agricultural and trade base in the East of Sri Lanka, then known as Digamadulla.The Brahim letter inscriptions on the rock face explains the procedures of building the temple under the guidance of Princess Chitra and the supervision of her accountant , a written evidence of affluence and opulence of the age old Digamadulla.The monastery had been built in and around a rocky mountain scattered with caves and ponds, which are now the home and play grounds of many a wild beasts. The temple which is found on site today is built on a mountain which holds the finely carved stone remains of five buildings and a ruined stupa, which is yet to be excavated.The half standing stone bridges and stairways suggests that the five rock scattered mountains found amidst the jungle were interconnected creating a 200 acre large monastery comprising caves constructed with the distinct drip ledge and remodeled with cement, bricks and plaster. The monastery which maintained a continuous Sanga tradition until the years of 800 AC were later abandoned due to the shifting of Kingdoms and South Indian Invasions. It was forgotten amidst the rising jungle and left for the elephants to roam for more than thousand years; until the monastery was rediscovered and reestablished for the meditating monks in 1964.The new stupa of the hermitage, which stands on a 500 feet tall hill top, is enshrined with the relics of Lord Buddha and his two main disciples;ArhantSariputta and ArhantMoggallana. The relics were found on site during the excavation of a stupa and are a unique and ultra-reverend combination for many a Buddhists in the country. Although the end of the civil war, which engulfed the East coast of the country for the last two decades, had seen an increase of travelers to Ampara, Buddangala monastery still remains hidden among the jungle, aforest hermitage of ancient tradition.Things To Do - Meditation, Pilgrimage, Hiking, Photography, Archeology"},
{"town": "Hambantota", "place": "Kumana National Park", "description": "Kumana is one of the most important bird nesting and breeding grounds in Sri Lanka. 255 species of birds have been recorded in the national park. Kumbukkan Oya forms the southern boundary of the national park. Some 20 lagoons and tanks support the extensive birdlife of the national park. The lagoons are shallow with depths less than 2 meters (6.6 ft.). Kumana villu is subject to occasional inundation with seawater. The elevation of the area ranges from sea level to 90 meters (300 ft.). The mean annual temperature is 27.30 °C (81.14 °F) and the area receives 1,300 millimeters (51.18 in) of annual rainfall.The Kumana area is part of an ancient civilization that goes back to the 3rd century BC. Rock inscriptions belonging to the 2nd and 1st centuries BC have also been found in the region. The Kumana National Park lies on the route of the traditional annual foot Pilgrimage to the Hindu temple at Kataragama. Both Tamil and Sinhalese communities take part in this pilgrimage. The number of birds observed in the national park has fallen in recent years. Environmentalists and wildlife lovers have expressed their concern over a road planned to be constructed from Kirinda to Panama which will run along the coastline of the park.The park Office located in Okande and in hrere you should buy a permit and Guide before enter the park."},
{"town": "Ampara", "place": "Camping in Kumana National Wildlife Sanctuary", "description": "With the reopening of the Kumana national park nearly two years ago, camping within Kumana had become a fad among the wildlife enthusiast that five main campsites maintained by the Department of Wildlife requires booking a good three months before.Birders who visit the Park are usually amazed at the sheer diversity of species that call Kumana home mainly due to the presence of 20 lagoons and tanks. These tanks are generally less than 2 metres deep and are often flooded by seawater and are spread throughout the park.Many campsites are located close to the water tanks and the Kumbukkan Oya, which forms the Southern boundary of the national park. The favourite among the five sites is the Gal Amuna Camp Site, Which stands by a natural rock Dam across the Kumbukkan Oya. The site is vast and surrounded by Kumbuk trees and provides a front seat view of the animals ranging from a vast number of birds to deer, elephant and leopards coming to the river for a drink. The naturally formed pool provides a rare crocodile free bathing spot to the campers.Heraligas Ara and Madametota too stand near the Kumbukkan Oya but are not the ideal bathing spots due to current and crocodiles. Yet the camping sites amply provide for the lack of water sports and animals and birds gathering by the river during the night and morning are sure to keep campers awake.The two Eda Kumbuka camp sites, thus named for the famous twisted Arjun tree too faces the Kumbukkan Oya and are two scenic sites with few hundred meters apart. Theyoffer many photographic opportunities, with or without animals, yet the proximity to the river means keeping a safe distance from the banks as the water level tends to record a sudden rise.The two river mouth camping sites, named for their closeness to the delta of Kumbukkan Oya occupies prized location between the river and the Indian Ocean and is ideal for bird watchers and turtle enthusiasts. The campsites, maintained by the Wildlife Department has to be pre-booked and a guide had to be secured while an off track vehicle is an essential due to state of the roads. However private campsite operators too function inside the Kumana Park and provide semi luxury and luxury camping options.Things To Do: Camping, photography, wildlife, sight seeing"},
{"town": "Kalpitiya", "place": "Kalpitiya Beach", "description": "The beach is a famous place to watch whales and dolphins and snorkel with beautiful corals. For explore the hidden wonders round the beach, prefect way is boat ride. visitors can canoe and also 4WD jeep ride along the deserted sand dunes between the ocean and inland.Beach is bestowed with natural beauty however it is unspoiled by tourism and surrounded fishing community.Sports activities such as Kitesurfing, Stand Up Paddling, Horse Riding, diving, skate boarding and surfing are standard around the islands. this beach is best way to enjoy evening sunset. There are a total of 14 islands in the sea and in the lagoon.Kalpitiya is located 130 km north of the Bandaranayke International Airport in Katunayake. this journey will take 4 and half hours. November to April, you will see clam sea and weather. February to March is best time to whale and dolphin watching."},
{"town": "Kandy", "place": "Huluganga Ella Falls", "description": "This waterfall is located at Hulu Ganga Town on the Panwila – Bambarella Road from Kandy.Height is about 75 metres and it starts from the Knuckles Range.Even during heavy rains the water is clear due to rocks, a variety of grasses, etc. At present there is a project to provide water to the people of Kundasale using this water. This also provides a magnificient scenario despite it being located at the centre of a town."},
{"town": "Gampaha", "place": "Henarathgoda Botanical Garden", "description": "Things To Do - Scenery, Photography, Environmental Study. In 1876 the first seedlings of Brazilian rubber tree ever planted in South Asia, grew and prospered in Henarathgoda Botanical Gardens.The seeds smuggled out of the Brazilian Amazon by Sir Henry Wickham and nurtured at London’s Kew Gardens led to an economic boom in the region and revolutionised the world. Situated 30 km from Colombo and just five km from Gampaha The Henarathgoda Botanical Gardens is often overlooked for more celebrated botanical gardens in Peradeniya and Hakgala, yet is celebrated for its collection of tropical trees including the first flock of para rubber trees, the originals that sired the rubber industry throughout Southeast Asia in Malaya, Indonesia and South India as well as in Sri Lanka."},
{"town": "Gampaha", "place": "Nara Mangrove Garden", "description": "Photography , Bird Watching , Boat Riding , Nature Study.Managed and owned by the National Aquatic Research Authority (NARA) the 14 hectare mangrove path is a research heaven for environmental scientists and ecologists in the region.The reserve serving as a green lung for the city records 29 species of mangroves and 33 other types of vegetation and its living creatures include 14 species of reptiles, 102 species of birds and 22 species of mammals including fresh water prawns, giant mud crabs, fishing cat, Chestnut Bittern, Black-headed Ibis, Asian Open-bill, Little Grebe, Lesser Whistling Teal, Pheasant-tailed Jacana, White-breasted Water hen, Purple Swamp hen, Water Cock and Common Moorhen. Among the invertebrates documented 48 species are butterflies and 22 species are dragonflies. The reserve also maintains a hatchery for giant fresh water prawns and a demonstration cage system for culture of brackish water fish species, with a view of assisting small scale aqua culture farmers in the country."},
{"town": "Gampaha", "place": "Bopagama Water Fall", "description": ""},
{"town": "Kalutara", "place": "Kaluthara Bodhiya", "description": "According to ancient chronicle Sinhala Bodhiwamsa, 32 saplings of sacred figs, which were sprouted from Jaya Sri Maha Bodhi, were planted in various parts of the country as instructed by Arahant Mahinda Thera. Further the chronicle states that this Bodhi tree existed intact till the 15th century AD.However, it is said that the Buddhist public began to view this place as a sacred place after a Pandyan prince named Wickrema Pandya planted a Bodhi tree in the Pahala Maluwa of the Kaluthara Bodhi premises in 1042 AD Prince Wickrema Pandya was viceroy in the Kalutara region during this period. After the Portuguese took control of the maritime provinces of Sri Lanka in the 16th century, the site of the Kalutara Bodhiya was transformed into most likely due to the strategic importance of its location.This site has a great religious attraction and many devotees from all parts of the island tour and is dedicated to the place. The fascinating beach of Kalutara, the magnet of the incoming tourist attraction of the region, is very close to this site. Many other tourist attractions such as Kalido Beach, the star hotels are also close to this place.The special attraction for the site visitor is its immense sanctuary built inside the pagoda. The devotees can go inside the wimalathe pagoda and worship the shine.Kaluthara Bodhiya is located in Kalutara, Colombo-Galle Road, 43 kilometers away from Colombo. You could easily reach this site by bus, take a Colombo Kalutara, Colombo Galle and get off at the town of Kalutara."},
{"town": "Colombo", "place": "Galle Face Green", "description": "Galle Face green is a best area to witness a marvelous sun set over Sri Lanka. The area was initially put to plan by Governor Sir Henry George Ward in 1859. The Galle Face Green was initially used for horse racing and as a golf course, but was also used for cricket, fly kites, enjoy a nice walk along the green. This is the start of the Galle road from Colombo. You may see the the Galle Face Hotel and The Kingsbury Hotel on either side, and also see the Hotel Taj Samudra on the land side. At the end of the green lies the magnificent Galle face hotel. Walking towards Fort you may see Old Parliament Building, Hotel Galadari and World Trade Centre.Galle Face Green Located in Colombo-Galle Main road closer to the Galleface hotel. It is 2km from Fort Railway station. You Can here by Tuk Tuk or other vehicle and also You can Park your vehicle in the vehicle Park (You have to Pay for this)."},
{"town": "Gampaha", "place": "Antiquities Replica Centre", "description": "Buy ancient Replicas , Study ArtworksCreating replicas of the beloved ancient landmarks , statues and art are in cement, fiberglass, terra-cotta, brass, bronze, ceramic, wood and stone to match its original is the responsibility of a selected group artists at the Antiquities Replica Centre at Bataleeya, Pasyala.May it be a row of elephants, a scene of deva-aradhana from the Polonnaruwa era, or a Buddha statue from the Anuradhapura era; the artists at the Antiquities Replica Centre fondly known as ARC have produced a replica closest to the original thus preventing looting and destruction of artifacts by mercenaries and tourists looking for a souvenir. Feats of this caliber certainly demands special training and the training is provided at the academic Unit of the ARC."},
{"town": "Gampaha", "place": "Warana", "description": "The temple is built on three levels and a climb of fifty steps brings the pilgrims to the first level, which consist Monks’ abode and hall of preaching.Another climb leads to the middle level or the mada viharaya where stands a 800 year old Sthupa and a shrine room of immense splendor.The final climb of 150 steps leads to the top of the rocky mountain and the third level of the temple opening great vistas to behold. The third level holds a sthupa built in the last century and the remnants of the original monastic meditation complex of 12 caves fashioned into chambers for meditating monks.Things To Do - Cave Tourism , Pilgrimage, Hiking, Photography."},
{"town": "Ampara", "place": "Senanayaka Samudraya of Inginiyagala", "description": "The Senanayaka Samudraya the largest body of water ever created in Sri Lanka is a pleasing sight at sunset. Cradled between Siyabalanduwa and Ampara this giant reservoir is bordered by the rising mountains of Inginiyagala creating a sight that it majestic and breathtaking.A development of the Gal Oya Project, the reservoir that irrigates the dry lands of the east of Sri Lanka, remains a glorious testament to the most ambitious irrigation development project undertaken immediately after of the Independence.A development of the Gal Oya Project, the reservoir that irrigates the dry lands of the east of Sri Lanka, remains a glorious testament to the most ambitious irrigation development project undertaken immediately after of the Independence.Today nearly sixty years after its construction the Senanayaka Samudraya provides relief to man, birds and beast in the area with providing water, habitat and livelihood. Nearly 70,000 families in the East depends on the reservoir for water for their agricultural purposes while nearly 200 elephants roam the Gal Oya sanctuary the catchment area of the reservoir. The islets within the reservoir are popular nesting grounds with many varieties of local and migrant birds and are best viewed by a boat ride in the reservoir.A journey on water towards the Gal Oya reserve falls across the Makara Kata or Makaraya, Dragon mouth in Sinhala. A whirlpool created by water flowing into a natural tunnel,Where Gal Oya falls to the reservoir. The boat safaris during the dry seasonalso bring the unusual sight of elephants swimming from one island to another island in the reservoir in search of food.Things To Do: Boat ride, sightseeing, explore, photography and bird watching"},
{"town": "Jaffna", "place": "Delft Temple", "description": "In a corner of the island, the base of a stupa is found along with the remnants of four subordinate stupas surrounding it. Legend has it that this was the location where ArhatSangamittaTheri rested during her voyage to the island carrying the sacred sapling of the Bo tree.The stupa is said to have been built by the Buddhists who resided in the island at that time. Situated closed to the sea the location also provides a panoramic view to the distant sea and beyond."},
{"town": "Ampara", "place": "Rajagala", "description": "Archaeology, Photography, Sightseeing, Hiking, Wildlife. Built in the second century BC enshrining the remaining of the ArhantMahanidaand ArhantIttiyaTheras, the envoys of Buddhism to Sri Lanka.Rajagala had been a flourishing monastery under the sponsorship of the Royals of East.Built by the Kings of Anuradhapura and having flourished under the sponsorship of Kings of Digamadulla, the Eastern kingdom of Lanka,Rajagala was known as ‘Girikibalawthisa’ in the ancient times. Standing 1030 feet tall the Rajagala mount is covered in thick jungle today. Yet the climb upwards, through an elegant rock steps formed in a gentle curve, along what once was a paved roadway, is scattered with the ruins of rock structures and moon stones, silent testimonies of a glorious age gone by.The Western slope of the mountain holds most of the rains, although the monastic village was scattered all over Rajagala.Two rock pools built in the vicinity of two ruined stupas have now become the watering holes of the elephants while the rock plateau around the pools are scattered with intricately carved rock pillars, parts of a sophisticated structure also complete with urinals and toilets.A broad path, which would have been an elegant roadway, leads down the plateau passingchaityas, viharas, dwellings, dining halls and ancient sculptures scattered into pieces. Among the ruins are the unique rice and water bowls, which were used to store water for the use of pilgrims and offer the first harvest of the farmers who lived nearby to Lord Buddha. The bowls giant in proportions and beautifully carved lies lost, dislodged but in full form waiting to be established and reformed. The water spouts, which carried water to the water bowls known as ‘pinthaliya’toolay scattered broken, while one water bowls had been broken into four by treasure hunters.Hidden away in the thick jungle is a huge block of stone 16 feet long with a half-finished Buddha image carved on it. The line of the statue are straight and are in right angles yet lack the detailed touch of a master, who after the first initiation of his apprentice had failed to finish the sculptor, which was forgotten to the thick jungle.Above the main structure of the temple lies hundreds of caves carved with the drip ledges and modelled and decorated to house the meditating arhants of the monastery. Each cave carries the inscription detailing the donor, the time and the procedures, witnesses of the compound administration structure, which prevailed in the Kingdom.Untouched by time, many of the walls, doorways and interior structures of these caves are still in place. Some had been refashioned with brick while others are adorned in stone. The walls inside are covered with plaster and would have been full of murals. Each cave had been built to catch the wind and is cooled by internal draughts.Although they are yet be excavated and examined by archaeologists proper; the cave had stood perfect form for the last two thousand years as if its inhabitants have just left. Yet one or two are still in use, the preserve of the leopards, whose home they have become."},
{"town": "Ampara", "place": "Dome Houses", "description": "The dome shaped houses in Pottuvil built as a settlement for the tsunami affected is proving to be a solution to the hot and dry climate in Ampara while promising to be tsunami resistant.The story of these dome shaped housed village started way before the tsunami when the 280 families of Inspector Eatham were forced to leave their homes 1990 due to the war and scarcity of water. They were resettled in Komarai, where they faced the 2004 December tsunami, which forced to leave their adopted homes in search of shelter with relatives and friends. The fear of another tsunami led them to their old village where dire conditions like scarcity of water and lack of proper housing awaited them.These strange shaped dwelling celebrated for their versatility and the simplicity of the building process that requires minimum skilled labor and building materials were built following the destruction of nearly 12,000 houses by 2004 tsunami, which savaged the Eastern province of Sri Lanka as a solution to the challenging situation of the members of Inspector Eatham community.The dome houses introduced to the country by Solid House Foundation were constructed with reusable pneumatic formwork, which was produced by BingFo in the Netherlands and was transportedto the location while other materials had been purchased locally. Compressed Stabilized EarthBlocks were introduced for additional straight walls which separated the inside compartments.The houses includes a living area, two bed rooms, a kitchen and an adjoining bathroom while a rain water harvesting tank for each house was introduced to reduce scarcity of water.The houses dome shaped with a central tunnel and a sky window leaves the inside of the house cool while the dome shaped house is believed to have more resistancetowards future natural disasters.Things To Do: Sightseeing and research"},
{"town": "Ampara", "place": "Lahugala Kitulana Forest Reserve", "description": "Home to a nearly 200 elephants who feeds on the flourishing grass lands around its main three tanks and numerous watering holes, LahugalaKitulana Forest Reserve is a 1554 hectare canvas of wildlife and archeology.Formed mainly by a dry zone evergreen forest the reserve provides field after field of water straw grass, a favorite snack of the elephants while the three main reservoirs –Lahugala, Kitulana and Sengamuwa provide never ending opportunities of water sports to the elephants. The elephants share the reserve with other animals like endemic toque macaque, common languor, sloth bear, jackal, rusty spotted cat, fishing cat, leopard, wild bear, Indian muntjac deer, spotted deer, sambar, pangolin and black naped hare.The reservoirs and waterholes are also home to large number of local and migratory birds like pelican, purple heron, painted stork, lesser adjutant stork, white bellied sea eagle, grey headed fishing eagle, common kingfisher, stork billed kingfisher and white breasted kingfisher. Endemic birds like comb duck, rare red-faced malkoha and Sri Lankan Spur fowl too can be seen the park.The reptile inhabitants of the park include Black tailed python, flying snakes, Sri Lanka cat snake and Russell’s viper while the amphibians include endemics like Banded bull frog, Atukorale's Dwarf Toad and cricket frog. An electric fence is being built on the southern border of the park to protect the four neighbouring villages of wild elephant encroachment while the reserve itself is under the threat of poaching, logging and over grazing.Things To Do: Wildlife, elephant watching, photography"},
{"town": "Nuwara Eliya", "place": "Gregory Lake", "description": "Lake Gregory was constructed during the period of British Governor Sir William Gregory in 1873. The lake and the surrounding area make up the Gregory Lake Area.However, the lake was mainly used for recreation and leisure after its construction. At its peak of fame, Gregory Lake was the most important attraction in the area and was used to relax by many visitors.In 1913 the waters of the lake were directed into a tunnel which flows to a hydro power station at 'Blackpool' between the town and Nanu Oya. The power station continues to supply electricity to the town to this day. In British times Lake Gregory was used for water sports and recreational activities. Today also water sports and picnic tours are available here."},
{"town": "Ampara", "place": "Bandaraduwa", "description": "Bandaraduwa, one of the adopted homes of Vedda community, who were displaced by the GalOya development project, is a forest reserve rich of bio diversity today.With the damming of the Gal Oya River in 1950s under the Gal Oya Development Scheme and with the creation of the Senanayake SamudrayamanyVedda settlements like Hennebedda, Gallobe, vanished. Some of them were re-settled in new settlement under the Gal Oya scheme, like Paragahakelle and Wavinna, while the rest opted to seek other pastures like Pollebedda, Bandaraduwa and even in Namal Oya.Deep in the heart of a dense jungle infested with wild beasts in Bandaraduwa lived in complete seclusion the last son of the famous Tissahamy, the jungle vedda outlaw of Bintenna, immortalized in Dr.Spittel's 'Savage Sanctuary', labelled as a 'fugitive' in the eyes of the law. Tissahamy's daughter Kombi, too lives in Gal Oya, close to her brother, Tikiri’s place of abode in Bandaraduwa.Today the descendants Tikiri and Kombi lead a life different to their parents, they do not depend on the jungle but are chenna and paddy cultivators and forgotten are their language and many ancient traditions. Their children attend the school nearby and dreams of a future strange to their ancestors.Things To Do: Explore, Photography"},
{"town": "Ampara", "place": "Gal Oya National Park", "description": "Initially established as the catchment area for the Senanayake Samudraya, a reservoir created by damming the Gal Oya River at Inginimitiya Gal Oya National Park has grown from its original 9324 hectares to nearly 63,000 hectares today giving sanctuary to many a wildlife and winning a name as a big game sanctuary in the region.The park with its rich wetland is a heaven for nearly 150 species of birds and migratory birds like Painted Storks, Pelicans, Cormorants and Teals gather in flocks to the Senanayake Samudraya for feeding and nesting while local bird species like Grey Dove, Malabar Horn Bill and Grey Horn Bill, Red faced malkoha, The White-bellied Sea Eagle, and Grey-headed Fish Eagle too are found in abundance.However the park is renowned for the herds of elephants, who roam the park in hundreds while Sri Lankan Axis Deer, Muntjac, Water Buffalo, Sri Lankan Sambar Deer, Leopard, Toque Monkey and Wild Boar too call Gal Oya home.Among its other attractions is the Makara Kata or Makaraya, Dragon mouth in Sinhala. A whirlpool created by water flowing into a natural tunnel,Where Gal Oya falls to the reservoir. Makaraya can be best viewed crossing the Senanayake Samudraya by boat from Inginiyagala as an alternative method of entering the National Park. On this route is the Bird’s Island,an island amidst the reservoir used by birds for nesting, especially the eagle species.Things To Do:Wildlife, bird watching, photography, camping, archeology"},
{"town": "Ampara", "place": "The Steaming Hot Water Wells of Mahaoya", "description": "Wrapped in legends of its origin and their mythical healing powers of its water the seven hot water springs of Mahaoya is a magnet to the travelers, who had been flocking to Ampara with the end of the thirty year war.Located about 2km off Mahaoya town, the springs are said to be the hottest spring of all the hot springs in Sri Lanka. The temperature of the hottest well is about 56C .Each spring is enclosed by a stone wall to form seven individual wells, which in turn are covered by a wall to provide privacy to those who bathe. The size of each well varies. The bottom of the well is formed of quartz, sand and gravel and thus the water is clear and not muddy. The temperature of each well varies and due to its mineral composition the water is said to cure skin ailments and arthritis.The best time to visit is either early in the morning or late evening when the sun goes down as it is quiet and sounds of the night give a calming effect. A ticketing counter at the entrance issues tickets and provide the visitors with buckets for a nominal fee and the visitors would be advised to use the water sparsely so that the springs will flow for posterity. Furthermore the use of soap should be avoided in order to reduce the pollution of the spring water. Bathing, sightseeing"},
{"town": "Negombo", "place": "Negombo", "description": "located at the mouth of Negombo lagoon, set amid lush grove coconut palms feels the real spirit of the sea.Outrigger canoe and the catamaran used as fishing vessel still can be seen and also has a small port."},
{"town": "Kurunegala", "place": "Panavitiya Ambalama", "description": "Pilgrimage, photography, sightseeing, caving.Panavitiya Ambalama is an ambalama situated in Sri Lanka.Panavitiya Ambalama is situated near Narammala in Kurunegala District, Sri Lanka . To reach it, one must travel about 4 km along a small road away from the main road.It is said that this was built during the 18th Century. It is believed that the ambalama is situated to the side of a footpath from Dambadeniya to Kurunegala and Yapahuwa. This is conserved by Archaeological Department, Sri Lanka."},
{"town": "Galle", "place": "Whale Watching in Mirissa", "description": "Mirissa is the new Trincomalee, with the whales, the gentle giants of the ocean and the dolphins parading their presence in the deep seas of Mirissa.Situated at the southern coast of Sri Lanka from beyond Mirissa coast lies the Indian Ocean its vast majesty right up to the Antarctic land mass. These amazing marine mammals migrate through these vast and fertile stretches from December to April during the annual breeding season. Mirissa itself is a quiet and peaceful coastal town boasting unspoiled beaches. Blue whales, Bryde´s whales, Sperm whales, Fin whales, bottle nose dolphins, common dolphins and spinner dolphins grace the waters of Southern Seas of Sri Lanka from Weligama to Mirrissa and can be found within just eight to ten nautical miles from Mirissa harborSetting off from Mirissa there is a 90% opportunity to come across Sperm whales and good pretty chance of sighting the Blue whale as well. There are believed to be around 26 different species of whales traversing this region and this includes the well-loved dolphin.The movement of whales in the Southern Costs of Sri Lanka had been under scientific scrutiny for the last decade and was well documented by The Voyage of Odyssey, the second research vessel to do research on marine life off Sri Lanka's southern coast in 2003.\"To see a Blue whale at sea is something most of us can only dream about. To see more than one in a lifetime is a rarity reserved for a fortunate few,\" Genevieve Johnson, a research crew member, was quoted as saying in one of the reports in 2003, commenting on abundance of whales in Southern seas of Sri Lanka.Dolphin and Whale watching season falls from November to April in down south. Morning session will starts around 6.30 amfrom Mirissa fisheries harbour. Total trip duration is 3 to 4 hours and will depend on sea condition.Almost all the boatshave roof, seats, and toilet facilities are equipped with life raft, life jacket, life rings and communication equipment and are registered with Ministry of Ports and Aviation while Passengers are insured by Sri Lanka insurance cooperation.Things To Do :Whale watching, Photography, Sightseeing"},
{"town": "Gampaha", "place": "Pineapple in Belummahara", "description": "Visit Pineapple Plantations , Agricultural Study , Agro Tourism.This traditional cultivation, which has a history of over six centuries, has now become the livelihood of nearly 500 families in the areas of Gampaha, Kotugoda,Udugampola Meerigama, Kirindiwela. Kuliyapitiya, Radawana,Nittambuwa and Pasyala.Although pineapple plantations are located in the Gampaha and surrounding areas, pineapple traders are doing their business cultivation at Imbulgoda , Balummahara and Mudungoda areas which are along the Kandy Road. He said over 400 families depend on pineapple business and the Government's assistance is highly needed to expand their business activities.The Sri Lanka Tourist Board and other private company tour groups stop at their stalls to enable tourists to buy pineapple."},
{"town": "Ampara", "place": "Govinda Hela of Siyambalanduwa", "description": "Standing five hundred meter tall over the rivers, tanks, bunds and elephant infested jungles Govinda hela was once the unreachable fortress of King Buwanakabahu of 6 century AC, the rulers of Eastern Digamadulla when the tyrant Invading King Kalinga Maga was ruling the ancient Rajarata, the kingdom of Anuradhapura and Polonnaruwa. The mountain re-discovered by Colonial British was named Westminster Abbey, a poor comparison and tribute to this majestic creation of nature. The trek along the footpath begins from the Sri Buvanekabahu Viharaya at Siyambalanduwa; about 300 km from Colombo, in the Moneragala district and the incumbent priest of the temple is a gracious host, assisting the dire needs of the climbers in times of trouble.The forest reserve is the home to numerous species of birds as well as large families of wild boars, who tend to surprise the unwary travelers. The two km trek upwards is not for the weary and faint hearted and the likelihood of getting lost without a proper guide is high in the jungles surrounding Govinda Hela.After crossing two bridges and travelling nearly half km the trek tend to become perilous with many steep rocks and high slopes.After the dare devil climb the view from the top and cool breeze compensate the attempts. The ruins scattered on the top are the remains of a palace and a monastery but the main attraction is the ‘Hulan Kapolla’ , a space between two rocks through which a gushing wind blows, with the loud but unmistakable \"ho, ho\" sound of a strong blast. Yet the climax of climb is the view from the top, expanding beyond the boundaries of Gal Oya basin covering reservoirs, mountains and streams.Things To Do: Trekking, mountain climbing, archeology, photography and bird watching"},
{"town": "Jaffna", "place": "Delft Growing Stone", "description": "A rock which had been adding inches through the yearshad gained the reverence of the inhabitants. The devotees of kovil in the vicinity holdpooja by the rock due to its dim similarity to a hood of acobra. Growing rocks seems to be the fashion in Delft, with another rock by the sea showing similar growth pattern. Shaped like a canoe the phenomenon is held to be the calcite build-up from sea waves that wash over it.Things To Do :Sightseeing, Photography"},
{"town": "Ampara", "place": "Sangamankanda Point", "description": "Sangamankanda is the most Eastern point in Sri Lanka, where the beaches are still unsullied and as wide as 100 meters.Lighthouse at this Eastern corner of Sri Lanka has been built in 1947 with a height of 25feet but was destroyed during the 2004 tsunami and only a 15feet of the light house now remains.Sangamankanda lies on the Potuvil - Kalmune route and can be identified as a small hillock lying close to the road. But to reach the light house one needs to trespass private property and walk quite a few meters from the main road.There are also ruins of an ancient Buddhist temple and a newly built Ganesh Kovil on site.Things To Do - Swimming, surfing, hiking, camping, photography, sightseeing."},
{"town": "Ampara", "place": "Makaraya", "description": "The Makara Kata or Makaraya, Dragon mouth in Sinhala is a whirlpool created by water flowing into a natural tunnel,Where Gal Oya falls to the senanayaka samudraya reservoir at Inginiyagala.Makaraya can be best viewed crossing the Senanayake Samudraya by boat from Inginiyagalaas an alternative method of accessing the Gal Oya National Wildlife Park. On this route is the Bird’s Island,an island amidst the reservoir used by birds for nesting. Elephants braving waters of Senanayaka Samudraya to reach the island for feeding too is a common sight at dusk in the dry seasons. Makaraya is also one of the four main camping sites at Gal Oya Wildlife Park and one favoured by ardent bird and elephant watchers.Things To Do: Wildlife, bird watching, photography, camping and boat ride."},
{"town": "Ampara", "place": "Hot Water Springs in Wahawa", "description": "In the pastoral village of Wahawa in Padiyatalawa, are eighteen hot water springs scattered all around the village with tanks built around to store the water, which are available at various temperature levels. They are found in gardens, amidst forest patches and paddy fields and an eternal source of hot water to the villagers. Yet the most peculiar spring of all is an artesian well, which shoots hot water twelve feet high and provides the visitors and villagers with refreshing hot water showers.Hot water springs found along a narrow belt running from Hambantota to Trincomalee occur within the boundary of two main geological units -- Highland and Vijayan complexes. These springs are surface signs of subsurface hidden heat sources such as huge bodies of ‘hot dry rocks’, ‘deeply extending fracture zones’ or concealed magma chambers’.The temperatures of the thermal springs range from 350 to 610 Celsius and only limited preliminary scientific studies with no detailed geological studies, geophysical exploration and test-drilling have been conducted so far.Things To Do:Bathing, research and explore"},
{"town": "Jaffna", "place": "Delft Dutch Fort", "description": "Once a Portuguese strong hold and a feared prison, the Delft Island Fort stands in ruins today. It was recorded to be a very complicated two storied edifice, full of long narrow corridors and little square rooms.In one corner of the fort had been the dungeon, a small square room, with a floor below ground level without any door, and having only one small window leading into the interior of the fort. The prisoners had been pushed in through this little opening or let down through a trapdoor in the floor above, and could have got out only by means of a rope many meeting their death in this little chamberYet gone are the strong fort and the fierce dungeon and the only remaining structure is the Dutch dovecots, used to house messenger pigeons, which still stands in perfect form."},
{"town": "Ampara", "place": "Shasthrawela", "description": "Once a great seat of learning in the East of Sri Lanka, Shasthrawela was the abode of five hundred Arhants and was known as the PabbathaBodhigiri Vihara.Today only ruins of a once grand complex of preaching halls, viharas, dagabas and Buddha statues remain of these grand vihara initially built by King Kawantissa during the second century BC.A stone inscription on site states that King MahaDhatakaMaha Naga, son of PudakanaGaminiAbhaya, grandson of King DevanaPiyaGamini Naga has built and donated monastery to the MahaSangha.At the base of the hill stand the ruined remains of a large stupa, almost 500 feet in circumference, and 60 feet in height, one of the largest stupas in the Eastern Province.A little further in lies the entrance to the monastery, through a narrow and steep uphill pathway strewn with the ruins of an ancient rock staircase and adornments.The stairway leading to the upper caves has become twisted with the roots and undergrowth, making the path a precarious one. It opens up into a clearing with a large cave facing the northwest. Within it lie the remains of a large reclining Buddha statue, almost 30 feet in length, and destroyed by treasure hunters.Pilgrimage, sight-seeing, photography, hiking"},
{"town": "Anuradhapura", "place": "Aukana", "description": "This Buddha statue was carved during the reign of king Datusena in the 5th century. Height of this Buddha statue is more than 40 feet (12 m) and resting on beautiful lotus stone pedestal. This amazing Buddha statue carved according to the asisa mudra and this statue has built in a mathematical way. That is, when rainy days you can see drops of water that falling from the point of nose straightly down to the center of between lord Buddha’s feet. It demonstrates erect of this statue. This statue carved out of the single rock.The statue had been located within a large image house or shrine, of which parts of the walls still remain. The structure was made of brick and stone, and was 74 feet (23 m) long and 63 feet (19 m) wide.This aukana statue face to splendorous Kala wewa (tank) reservoir. There have various caves around the statue.Aukana buddha statue situated aukana village, kekirawa in Anuradhapura district. You can easily reach to this destination from dambulla bus station. Every morning a bus leaves to aukana from bus station and several buses go to aukana from kekirawa which is on the kandy – Anuradhapura road.Evening is the best time to visit aukana. You can also visit to Kala wewa reservoir, Sun goes down, bird’s flocks fly away over the tank, it gives you to amazing view."},
{"town": "Ampara", "place": "Veheragala Temple", "description": "Deep in Mahaoya close to the hot water wells is an ancient monastery of the second century BC, which had been the abode of meditating monks even few decades ago.The ruins of the ancient monastery spread across nearly 10 acres and had been savaged at various times in search of treasures and building material. The two stupas at the bottom of the rock plateau had been ravaged to a pile of rocks. Stone tablets made are found in site broken while the stone door frame had been stolen by relic hunters. Closer to the stupa are the remain of a building including a moonstone or a sandakadapahana, six stone pillars, entrance steps, stairway and the Korawakgal or stone balustrades. Inside the building boundaries are stone seats, a stone sink and a replica of the Lord Buddha’s feet, the only remaining monuments within the monastery boundaries.Scattered over the grounds are more ruins of buildings and stupas with stone tablets for offerings. The drip ledged caves of the monastery had been separated into rooms with brick walls and each cave has an inscription detailing the donation done by local nobles. The three reservoirs found nearby had been the water source for the temple and for irrigation yet they too lay ruined today.However the temple was given a fresh breath of life when it was converted to a meditating monastery nearly four decades back by a leading meditating master and was the meditation retreat of late Ven. Gangodawila Soma Thera during the early years of his life. However the monastery was damaged by a hurricane nearly two decades ago and is yet to be revived to life while the new temple built nearly one mile away was built in his memory and serves the village around.Things To Do: Meditation, archaeology, sightseeing and photography"},
{"town": "Hambantota", "place": "Bundala National Park", "description": "Bundala harbors 197 species of birds, the highlight being the greater flamingo, which migrate in large flocks. Bundala was designated a wildlife sanctuary in 1969 and redefined to a national park on 4 January 1993. In 1991 Bundala became the first wetland to be declared as a Ramsar site in Sri Lanka. In 2005 the national park was designated as a biosphere reserve by UNESCO, the fourth biosphere reserve in Sri Lanka. The national park is situated 245 kilometers (152 mi) southeast of Colombo.Best time to visit is September to March: during this period, migratory birds arrive at the park. The ecological areas of the national park contain seven terrestrial habitat types and six wetland types. A total of 383 plant species belonging to 90 families have been recorded from the park. In the small degraded patch of mangrove found at the Bundala lagoon area, black mangrove trees are widespread. The strip of Palu (Manilkara hexandra) tree forest on the sand-dunes east of Bundala village is a unique type of forest in Sri Lanka. The Bundala National Park has been identified as an outstanding Important Bird Area in the South Indian and Sri Lankan wetlands. 324 species of vertebrates have been recorded in the national park, which include 32 species of fish, 15 species of amphibians, 48 species of reptiles, 197 species of birds and 32 species of mammals. 52 species of butterflies are among the invertebrates. The wetland habitats in Bundala harbors about 100 species of water birds, half of them being migrant birds. Of 197 avifaunal species 58 are migratory species. A few Asian elephants still inhabit the forests of Bundala. Other mammals seen in the park are toque macaque, common langur, jackal, leopard, fishing cat, rusty-spotted cat, mongoose, wild boar, mouse deer, Indian muntjac, spotted deer, sambar, black-napped hare, Indian pangolin, and porcupine."},
{"town": "Ampara", "place": "Bowattegala Monastery", "description": "High on the banks on Kumbukkan River hidden amidst the dense jungle is an ancient monastery of third century BC.Lost to the forest and wild beast the caves, rock structure and Buddha statue lay abandoned with time scattered and unexplored.Bowattegala, a rock strewn mountain in the midst of Kumana, had been first fashioned a monastery in the third-second century BC by the ten noble brothers of Kataragama, known in Sri Lankan history as the ‘Kataragama-kshathriya’ .A rare but lengthy cave inscription speaks of the genealogy of these Souther Royals, who ruled the Southern and Eastern provinces of Lanka under the regime of the main King in Anuradhapura.These noble princes of Southern Sri Lanka had been participants of the festivals held in Anuradhapura in celebration of the arrival of the sacred Jaya Sri Maha Bodhi in Sri Lanka and had received one of the first eight plants to shoot from the sacred Bodhi Tree. Although it was long believed this Bodhi shoot to have been planted in Kataragama, some archeologist speculate that the young Bodhi plant could have been planted in Bowattegala; thus the reason for a singularly lengthy stone inscription within the monastery groundsMeanwhile successive kings and provincial nobles too had added on to the splendors of the monastery and the cave inscriptions speak of a Minister in the name of Naka, King Mahasen and King Jetta Thissa of making various contributions throughout the history. The caves found on the mountain are almost all drip ledged suggesting a monastery spread over the mountain. However some of the caves had been renovated at later era with the use of bricks and timber. Plastered interiors of some caves still remain in place while partially destroyed timber door frames remain at the entrance to some caves.Some caves carry evidence of inhabitance as late as 17 th century although whether the monastic life was intact at the time is yet to be discovered.The grounds of the monastery too had consisted buildings of various forms and eras but none remain intact save for the piles of brickwork and rock pillars. Ruins of three stupas brick work and foundation lay scattered atop the rock projections of the mountain while rock ponds had been rebuilt and improvised as water resources for the monastery, by King Jetathissa as a tribute to the service rendered in spreading theDhamma of Lord Buddha.Despite repeated royal sponsorship and benevolence the monastery had not survived to its second millennium and had said to have provided shelter for the singular meditating and rebels, who were fighting the colonial governance since 16 th century.Things To Do: Pilgrimage, sightseeing, photography, hiking"},
{"town": "Ampara", "place": "Muhudu Maha Viharaya", "description": "Built nearly 2000 years ago to celebrate the landing of Queen Vihara Maha Devi, the wife of King Kawantissa, the ruler of Rohana and the mother of King Dutugamunu, the hero of Mahavansa Chronicle, Muhudu Maha Viharaya or the Temple by the Sea’ is just a stone throw away from the Pothuvil Town.Although the archeological evidence holds the temple to have been built in the fifth century AC by King Mahanama, the legend holds that the temple also known as the Samudra Maha Vihara, is to be the place wherethe storm tossed Princess Devi landed in the Ruhuna Kingdom. According to a stone inscription that was found in the vicinity of the shrine, it had also been called the Ruhunu Maha Viharaya in the days gone by.The historical facts are heavily clouded with myths and legends. The story based on the arrival of Princess Devi claims that she was first spotted at a village near Pottuvil but when the king arrived at the spot the craft carrying the princess had drifted to the ocean and the disappointed king questioned the villagers 'Ko Kumari?' which eventually gave the village its name 'Komari'. Later the princess had touched land at Arugam Bay and the villagers told King Kawantissa that the princess had landed at 'Ara Gama' which later changed into 'Arugam'.The temple site which is under the heavy threat of encroachment by villagers has been reduced to a small shrine with three granite statues. The central statue is of the Buddha with two more sculptures believed to be those of royalty facing it. Believed to have been built in the 5th century A.D during the reign of King Dhathusena, many believe the royal figures depicted in worshiping position are to be those of King Kavantissa and his Queen Vihara Maha Devi.The great stretch of beach behind the temple is yet to be excavated and is believe to hold many hidden artifacts swept under the sands of times.Things To Do: Archaeology, photography, pilgrimage, sightseeing"},
{"town": "Ampara", "place": "Habuthala Viharaya or Tharulengala Monastery", "description": "Few hundred meters away from the Karandahela reservoir in the corner of Hulannuge is HabuthalaViharaya or Tharulengala Forest Hermitage.Built before the second century BC by King Kawanthissa on a 633 feet tall hillock and developed constantly throughout theEastern history the monastery is home to some of thelargest drip ledged caves in the country.This 512ft long drip ledged cave is 30ft broad and 82ft high at the highest point with eight levels in its interior. The signs of brick layered interiors and polished and cemented inner walls still remain within the cave indicating that the cave was utilised as worship or a gathering hall for the monks of the monastery. The time and origin of its construction is unknown as there are no inscriptions within discovered so far.Nearby this mammoth cave is another one of 200 feet length, drip ledged and constructed with the same interior finish, believed to have been used as a community quarter than an individual abode.The next largest cave in the complex is a cave styled as a shrine room. Situated near the entrance to the monastery the cave is s 175ft long, 31ft broad and 35ft high & houses a 41foot reclining Buddha statue, now considerably damaged by treasure hunters. Once the plastered and mural adorned inner walls and ceilings of the cave had given away to the perils of time revealing earlier drawings of Vedda community, who had called the caves their home prior to the construction of the monastery. The drawings include scenes of hunting, war and animal flocks, suggesting a pre historic life style that was long lost. The entrance to the cave is adorned with a simple rock carved stairway and a sandakadapahana or a moonstone, that lie in ruins today.At the water's edge of this Karandewewa tank is the remains of an ancient Stupa belonging to the earliest constructions of the monastery. Two more ruined stupas are found further uphill and believed to have enshrined the remaining of the arhants, who had once meditated at the grounds of Habuthala.Scattered among the grounds of Habuthala Viharaya is rock ponds of various size. Created to store water for the use of hundreds of monks who lived and meditated in Habuthala viharaya, these ponds are the play grounds and abodes of the wild leopards and bears, who inhabit most of the monastery’s caves today.Things to Do: Photography, sightseeing, pilgrimage, hiking, wildlife"},
{"town": "Gampaha", "place": "Kelaniya Raja Maha Viharaya", "description": "The history of Kelaniya dates back to pre-Christian times. The city was related to the history of Ramayana as his king Yakkha, Vibhisana, was friendly to Rama in his fight against Ravana. Consequently, the cult of Vibhisana as the tutelary divine of Kelaniya continues to present itself.The annals, Dipavamsa and Mahavamsa, record in detail the tale of the Buddha's visit to Kelaniya on the eighth year after his Enlightenment. The jeweled throne, on which the Buddha sat while preaching, is said to have been enshrined in the stupa at the Kelaniya Raja Maha Viharaya.The temple is also famous for its image of the reclining Gautama Buddha and paintings by the native artist Solias Mendis which depict important events in the life of the Buddha, in the history of Buddhism in Sri Lanka, also incidents from the Jataka tales. It is the venue for the Duruthu Maha Perehera procession each January. An 18-foot stone statue of the Bodhisattva Avalokitesvara has been erected at the temple.Kelani Raja Maha Viharaya is situated 10 km northeast of Colombo. The main approach of the Vihara is the road that leads to Biyagama from the 4th mile of the Colombo-Kandy road. Another approach road exits the road from Kandy to Torana Junction, not far from the 5th mile marker. The sanctuary is sited on a higher plain ignoring the waterway Kelani that streams in front."},
{"town": "Bandarawela", "place": "Little Adam’s Peak", "description": "Ella is approximately 200 kilometers (120 mi) east of Colombo. The area has a rich bio-diversity, dense with numerous varieties of flora and fauna. Ella is surrounded by hills covered with cloud forests and tea plantations. The town has a cooler climate than surrounding lowlands, due to its elevation. The Ella Gap allows views across the southern plains of Sri Lanka.Do not challenge the magnificent sightseeing in Sri Lanka, Little Adams Peak, whether by considering the word \"Little\", it is called the sacred summit of Adams (Sri Pada, where the imprint of Lord Buddha is preserved) As regards the similarity between Two Mountains. Accordingly, the mountain was called as little Adams Peak.“Punchi Sri Pada” is some other name for this top. It is 1141 m in top. Little Adam’s Peak attracts many vacationers who come to Sri Lanka. Gradually with a clean hike as much as the mountain of Little Adams Peak you may consummation a really worth panoramic view. You need to walk via lush green tea plantations, waterfalls and paddy fields even as playing the sceneries.It will be invaluable if you can visit the place in the morning when the clouds roll. Other places like Little Adams Peak deliberate: \"How far Sri Lanka is worth and rich with beautiful natural destinations of Sri Lankan tourism\". It will feel like a neck exercise for visitors that you need to rotate your body to look for outstanding views for 360 degrees.It is absolutely necessary to say that ‘don’t forget to wake up early inside the morning and climb the mountain before it receives hot’ otherwise you'll feel tired. Although take a bottle of water with you. If you could have a cup of tea or something you could feel higher to your manner again to the lodge or domestic. It is wise to keep in mind that if you want to take a picture with the tea plucker who works in the tea plantations, they will ask for money."},
{"town": "Galle", "place": "Galle Fort", "description": "It is situated in 113 kilometers away from Colombo. The Galle Fort, also known as the Dutch Fort or the \"Ramparts of Galle\", is a historical, archaeological and architectural heritage monument, which even after more than 423 years maintains a polished appearance, due to extensive reconstruction work done by Archaeological Department of Sri Lanka. Galle lighthouse, Galle clock tower, Groote Kerk - Galle, All Saints' Church - Galle, National Museum in Galle, Old Dutch Hospital, National Maritime Museum Galle are main archaeological and architectural heritage monuments in Galle fort. The fort has a colorful history, and today has a multi-ethnic and multi-religious population. The Sri Lankan government and many Dutch people who still own some of the properties inside the fort are looking at making this one of the modern wonders of the world. The heritage value of the fort has been recognized by the UNESCO and the site has been inscribed as a cultural heritage UNESCO World Heritage Site under criteria IV, for its unique exposition of \"an urban ensemble which illustrates the interaction of European architecture and South Asian traditions from the 16th to the 19th centuries.\"Galle Fort is in Galle, which is located at the extreme southwest corner of the island, in the southwest coast of Sri Lanka, where the shoreline turns east towards Matara and Tangalle. The fort, like most of the forts in Sri Lanka, is built on a small rocky peninsula, belonging to the sea as much as to the land. As it exists today, it covers an area of 52 hectares (130 acres). Highway A2 provides road links to Galle from Colombo (a distance of 113 kilometers (70 mi)) and the rest of the country along the west coast or from the east along the south coast. Since 2012 an expressway has linked Galle to Colombo. Rail links are also available to Colombo and Matara. Sea route is through the Galle Port at the Galle Harbor."},
{"town": "Colombo", "place": "Pettah Market", "description": "You can buy anything you want. Pettah Market is one of Largest market in Sri Lanka. In here you can find out one productions in different choices. Watches and jewelery, shoes, bags, suitcases, clothing, cell phones, toys, electronics, souvenirs, spices such as turmeric, nutmeg to cocoa or black cumin, Etc. You get all the spices for a delicious Sri Lankan curry to cook.You have to be careful for buying some electronic and jewelleries, watches etc. because these all brands are fake but you can use that items one or two years. Advantage of buying items in Pettah, is cheap Price. You have to bargain for that.The main entrance to Pettah Market is the Khan Clock Tower in the middle of a roundabout. You can hire a Tuk Tuk going place to another place. It would be 50 LKR for 1KM."},
{"town": "Ampara", "place": "Okanda Beach", "description": "Depending on individual faith, people believe the whole region in and around Okanda are purified with the spirit of God of Kataragama, Skanda, Murugan or Al-Khidr, the Green Man of the Qur'an, the teacher to Moses. The multicultural nature of the region enables Buddhists, Hindus, Muslims and Christians to practice their faith in the safety of a sacred area. Hills, certain old trees, rocks and points along rivers are landmarks in a culture where everything is sacred and connected with mythical exploits."},
{"town": "Anuradhapura", "place": "Jathika Namal Uyana", "description": "The \"Jathika Namal Uyana\" is \"the largest Na-forest and pink quartz mountain in Asia\". This unrevealed unique natural heaven has been brought forward to the attention of the world almost 15 years before, by the \"Ven. Wanawasi Rahula Thero\". The Namal Uyana which is spectacular and attractive with its exceptional natural depths has a history of more than one thousand years.According to archeological researchers findings, the pink quartz in this historical place has a history of more than 550 millions of years. This unique place \"Jathika Namal Uyana\" is situated 7kms from Madatugama junction of Colombo - Anuradhapura highway. towards the road leading to Adiyagala. at Galkiriyagama in Sri Lanka. The NA Tree is a valuable resource which provides an excellent service not only for the people but also for the environment.These trees have expanded over 260 acres of land it is a marvelous scene to have a breath taking look at how they have stretched in that area. NA tree has got a peculiar smell which will enable anybody to sense that NA tree or trees are around. Botanically, NA tree is called \"Mesua Ferara\" and in English it is called the Iron Wood Tree. The group of NA trees are called Clusaiaceae or Guttiriferae. This significant tree is a native to Sri Lanka, India, Malayasia, Buruma, Thailand, and Papua Neviginnia. Buddhists has a great religious value for NA tree but not only Buddhists other religions also consider it as a sacred resource. It is also a meditation centre for the Buddhist monks around the island and other parts of the world. Iron Wood forest is a unique forest in Sri Lanka where the Iron Wood trees dominate the vegetation of the 260 acres of forest. The whole part of NA is also used herbal medicines and soaps, perfumes, and cosmetics. This was named as the national tree of Sri Lanka.This iron woods has been categorized to a cast by plant kingdom as cast of \"clusiaceae – guttifarceae\". These special two casts can be seen at the Jathika Namal Uyana. 85% will be the Mesna Ferra from the hole NA Trees of the NA Forest. This mesua ferra has been as the \"National Tree\" by the Sri Lankan Government. Some trees characteristic to the Sri Lanka also can be seen in this area. Three vegetation types of soil units have been revealed by geographical and biological units of University of Peradeniya Sri Lanka. Community related to the Pink Quartz (Up to 150-180m Sea Level) Trees and Bushes community rocky outcrop (Up to 150-180m sea level) Abundant area (Up to150 m Sea Level)History reveals that emperor Shajahan while constructing 'Taj Mahal\", the 7th wonder of the world brought all the necessary materials which are rare, from different parts of the world and he used marbles from Namal Uyana Pink Quartz Mountains to make it incomparable.Blessed with all these historical, archeological and geographical backgrounds surrounding this fortuned land, anyone who visits Namal Uyana Forest and the Pink Quartz Mountains will find the peace of mind and will forget all the sorrows of the outside world.Jathika Namal Uyana revealed 15 years ago, which has become the first NA Forest is the most popular sacred place among the people in Sri Lanka which has a great history during the era of king Devanampiyathissa in Anuradhapura.Ancient statues added with historical values are nearby Jathika Namal Uyana pink quartz mountain. Ruins of buildings, Bodhigara, Stupas, inscriptions further can be seen here. 60acres of forest has been apportioned as an ancient area Ancient statues added with historical values are nearby Jathika Namal Uyana pink quartz mountain. Ruins of buildings, Bodhigara, Stupas, inscriptions further can be seen here. 60acres of forest has been apportioned as an ancient area.The Ranawa village can be remembered as the starting place of Jathika Namal Uyana and the history of Jathika Namal Uyana commenced during the period starting from king Devanampiyathissa and ending with king IV Dappula. The inscription that is called Andiyagala was from by king IV Dappula. This epigraph proves the history of this unique place.Further the king IV Kashyapa has built huts in Rathmalagala Viharaya and it is a credible achievement by this area that the king IV Dappula made the Viharaya,also called Rathdematamal pirivena, later viharaya was ruined in Namal Uyana. Except other kings who ruled this area, King Maha Vijayabahu the 8th (B.C). took the initiative to promote Jathika Namal Uyna as a religious place which is having a botanical garden and a marvelous natural forest."},
{"town": "Gampaha", "place": "Alawala Devin Penne Ela", "description": "Named to remember a queen who leaped her way down to death, the stream is steeped in history and tangled in folkloreKing Vijayabahu III (1232 AD- 1236AD) of Dambadeniya era is believed to have sought refuge in two of the caves scattered near the stream while a deep pond nearby is called ‘Alipalwalla’ or the pool used to bath elephants in the days gone by. However the stream today holds no royal connection and serves a picturesque tracking destination to visitors far and near.Things To Do - Natural Bathing , Photography , Scenery."},
{"town": "Jaffna", "place": "Delft island", "description": "This island is named as Delft in the Admiralty Chart unlike the other islands, whose names are Tamil. The island's area is 50 km² and it is roughly oval-shaped. Its length is 8 km and its maximum width about 6 km. The most pleasant season is probably from July to August, when the bad weather has decreased but you are greeted with a slight breeze. January and February are cooler as in the rest of the island, but January can be wet. Except for the bus, there is no vehicle in the island and the visit to the island is usually done in the trailer of a tractor.In the western coast of the island there are remains of a 1000-year-old temple built by the Chola Dynasty, as well as the ruins of a Dutch colonial fort. The water is slightly brackish, and it is taken from shallow wells using buckets made from Palmyra palm leaves. The houses are fenced by stacked coral stones or palm leaves, which gives Delft its particular appearance. There are feral ponies on the island, descendants of forebears abandoned there in the Dutch period. The island was named after the Dutch city of Delft by Rijckloff van Goens. Visitors should take the ferry from Kurikattuwan to the southern tip of Pungudutivu (about 45 minutes by car from Jaffna), while the journey takes about 1 hour.There are two ferry services per day. One in the morning and other one in the afternoon but it is advisable to check first before planning your trip. The schedule is subject to significant changes due to weather conditions and boat conditions. On arriving at the island there is only one bus available, go and go on the single road. It is probably advisable to hire a tractor that can take you on a more detailed route.Portuguese Fort, Baobab Tree, Banyan Tree, Quindah Tower, Wild Horses, Sarapiddy, Foot Print, Pigeon Nest, Old Stupa, Old Stables are the popular attractions in the delft island."},
{"town": "Ampara", "place": "Rambakan Oya", "description": "Once dammed and tamed by the great Kings of Sri Lanka like King Saddatissa and Parakramabahu the great Rambakan Oya is a tributary of Mundeni Aru, which flaws though Borders of Moneragala and Ampara.Today after being cold stored for nearly three decades due to the war, Rambakan Oya irrigation project is back on track with a mega dam being built in Pollebadda, a village occupied by the Vedda, the Indigenous community of Lanka.Rambakan Oya would be the biggest irrigation project in the Eastern province and is expected to cost Rs. 2.5 billion rupees. Theproject provides clean accessible drinking water to over 2,500 families in the area who now walk miles fordrinkable water, in these semi-arid provinces.The dam will be over one kilometre long and 25 meters tall sustaining 130 square kilometres of water. The dam would have three sluice gates including a separate gate for the supply of drinking water.From the dam a 6.7 kilometer long Anicut is being constructed to feed the water to six other smaller reservoirs, which are also under construction. These six reservoirs would provide water to irrigate over 12,000 acres while a 12 kilometer underground canal carrying drinking water would be constructed connecting to a new reservoir named in Nilabe.Nearly 3000 families, who were exiled from their land due to raging war, would be resettled under the new irrigation scheme bringing hope to lives ravaged by a three decade long war."},
{"town": "Ampara", "place": "Wadinagala", "description": "Built damming the water of Pallan Oya River Jayanthi Wawa near the towering Wandinagala is an idyllic sight in an evening scattered with a few fishing boats and the ever present elephants around it gathered for a dip.Built in 1960 to the south of Senanayaka Samudraya Jayanthi Wawa stores nearly 93,000 square acres of water, irrigating fields of paddy and sugar cane. It is also source of livelihood to freshwater fisherman and provides drinking water to the Ampara district.The reservoir is a source of water to the elephant herds who roam the bordering Gal Oya National Wildlife Park and the flocks of bird like Little Cormorant, Malayan Night Heron, Lesser Whistling-duck and spot billed pelican, who gather at the reservoir in search of food and nesting ground.The elephants also roam the mountain of Wadinagala, which stands 2400 feet tall challenging the brave and the reckless.It is famed to be a mountain, one considered as an alternative to bear the foot mark of Lord Buddha and its heritage in ancient Buddhism is visible in many ruins scattered around the mountain. Beautiful guard stones, rocks pillars and moonstones lie amidst the towering forest of ebony and satinwood, which is been plundered by treasure hunters and illegal loggers to whom Wadanagala had become a heaven of profit. Being the second highest peak of the Gal Oya sanctuary, the climb towards the peak is perilous and should be undertaken with an experienced guide as the mountain is streaming with wild elephants.Things To Do: Sightseeing, elephant watching, bird watching, photography and hiking"},
{"town": "Hambantota", "place": "Yala National Park", "description": "There are six national parks and three wildlife sanctuaries in the vicinity of Yala. Among the largest is Lunugamvehera National Park. The park is situated in the dry semi-arid climatic region and rain is received mainly during the northeast monsoon. Yala hosts a variety of ecosystems ranging from moist monsoon forests to freshwater and marine wetlands. It is one of the 70 Important Bird Areas (IBAs) in Sri Lanka. Yala harbours 215 bird species including six endemic species of Sri Lanka. The number of mammals that has been recorded from the park is 44, and it has one of the highest leopard densities in the world. The area around Yala has hosted several ancient civilisations. Two important pilgrim sites, Sithulpahuwa and Magul Vihara, are situated within the park.It is situated in the southeast region of the country, and lies in Southern Province and Uva Province. The park covers 979 square kilometers (378 sq. mi) and is located about 300 kilometers (190 mi) from Colombo. Yala was designated as a wildlife sanctuary in 1900, and along with Wilpattu was one of the first two national parks in Sri Lanka, having been designated in 1938. The park is best known for its variety of wild animals. It is important for the conservation of Sri Lankan elephants, Sri Lankan leopards and aquatic birds."},
{"town": "Ampara", "place": "Nagapabbatha Monastery", "description": "Pilgrimage, photography, hiking, sightseeing, wildlife.Hidden amidst the Kudumbigala Wildlife Sanctuary and few miles away from the Kudumbigala Forest Hermitage are the remains of an ancient monastery lost to the time and the jungle.Ruins scattered over nearly 60 acres of jungle speaks volumes of its glory days but nothing moves a devotee other than the 36 feet reclining Buddha statue of Bambaragasthalawa. Built inside a cave, which had protected it from the hardships of nature, the giant statue made out of a mixture of clay and lime had succumbed to the malice of humans, who have dig in its head, feet and mid sections in search of treasure.The drip ledged cave, which house the statue of Buddha and Buddha statue itself is believed to have been built between fourth and eighth century yet the history of the monastery starts in the regime of King Gotabhaya who ruled the country in the years of 249-262 A.D. However a 200 feet long cave with partitioned interiors and plastered walls carries the inscription, which states that it is named ‘nagapawathasenasana ‘ and was built by a donor called ‘Mithra’. The cave is situated on the edge of a rock precipice, affording a spectacular view around and is believed to be the first cave constructed in this monastery. Worshipping halls, preaching halls, alms halls and toilet and bath facilities had been built in rock and bricks and decorated in subtle brick and masonry work and still remain in ruins amidst the monastery grounds, which now does not even have a direct road reachable by feet. Nearly ten ruined stupa stands on the rock cliffs facing the South-eastern beaches in the fourth century and would have been the white beacons beckoning seafarers of a country, whose land is filled with saffron robed monks and people who follows an age old Dhamma."},
{"town": "Ampara", "place": "The Dagger Clawed People", "description": "From Sri Lanka’s little known past of folklore and jungle tales comes a story of hairy bodied, short and dagger clawed people known to many as Nittaewo.Although some claims that Nittaewo is amisperceptionof a monkey ora sloth bear, others are convinced that they must have been an early species of hominids or ape-men in and around Mahalenama, of the Eastern Province. During the first century AD, Pliny the Elder mentioned the existence of a ‘beast-men’ in Ceylon.More credible information on Nittaewo unearthed in 1886, when a British civil servant named Hugh Nevill reported information on a strange race called the Nittaewo, who inhabited the then inaccessible mountains of the southeast Sri Lanka.The Nittaewo were reported to resemble orangutans or gorillas and were expert climbers of nearly one meter height. They had the ability to walk upright and were covered with reddish hair with claws of great length and strength. Nevill also learned that the Nittaewo used to descend from the rocks in gangs to steal meat that had been spread out in the sun to dry by Veddah hunters, who feared Nittaewo’s fearsome claws.He had also related the end of the Nittaewo tribe in the hands of the Veddas, where driven to desperation by the cruelty of these ‘little men’, the remaining group was rounded up by the Vedda and driven into a cave and was smoked for three consecutive days until they all died of hypoxia. However the first scientific investigation into the being of Nittaewo was made in 1945 by Professor W C Osman Hill of Edinburgh University, who came to the conclusion that Pithecanthropus of Java, a speechless hominid intermediate between modern man and the anthropoid apes, accords best with the tradition of the Nittaewo. Meanwhile in 1963 Captain A.T.Rambukwella theorised that the Nittaewo may have been a species of Australopithecus, described as small, man-like apes that stood erect and had a bipedal gait after expedition to the Mahalenama area in search of the Nittaewo.Investigation, history"},
{"town": "Galle", "place": "Kosgoda", "description": "At night marine turtles come ashore, dig a hole and lay their eggs, covering them up before heading back to see. To avoid predatory acts, several private turtle hatcheries have been set up along the coast. Visitors can see huge tanks filled with new born turtle hatchlings.After being fed, the baby turtles are taken to the sea and released when they are 2-4 days old, usually during the safer hours of darkness. Although October to April is the main laying season, some eggs can be found at Kosgoda throughout the year."},
{"town": "Ampara", "place": "Ancient Veheragala of Pulukunawa", "description": "The road to Pulkunawa village falls through the ruins of once a vast monastery built by a yet to be identified donor for an Arhant in the name of Pussadeva.The monastery grounds with its abundance of stone pillars of simple beauty and grace speaks of extensive construction done throughout the centuries starting from the late first century BC. The ruins scattered at the foot of the mountain consist mainly of constructions, that are in the front of the monastery including preaching halls, alms hall, pilgrim houses and intricately carved stone stairways leading to the top of the mountain.The Buddha statues in shrine rooms had long been vandalized in search of treasure while the simply adorned stairways had been removed elsewhere. A further up the mountain a ruined stupa believed to be enshrining the remaining of Arhant Pussadeva stands next to a pond improvised to store rain water for the use of the monastery. Adjoining the pond and the stupa lay more ruins of monastery buildings scattered disorganized anduninvestigated. From this second tier of the mountain a six hundred feet stone stairway leads the way up to the mountain, where lies the drip ledged caves for the meditating Bikkhus. The inscriptions carved inside the caves speak of the Arhant Pussadeva, who was well versed in AnguttaraNikaya, a paliverse canon. However missing are the details of the illustrious donors, who had been the builders of the monasteries in East. Pulukunawa or Weheragala had been a more of a poor man’s monastery with its main patron being an accountant in the service of the ruler of East."},
{"town": "Ratnapura", "place": "Sri Pada (Adam's Peak)", "description": "The mountain is located in the southern reaches of the Central Highlands, in the Ratnapura District and Nuwara Eliya district of the Sabaragamuwa Province and Central Province —lying about 40 km northeast of the city of Ratnapura and 32 km southwest of the city of Hatton. The surrounding region is largely forested hills, with no mountain of comparable size nearby. The region along the mountain is a wildlife reserve, housing many species and endemic species. Most local people believe dwarf elephants (kuru ali) live in this samanala forest.Adam's Peak is important as a watershed. The districts to the south and the east of Adam's Peak yield precious stones—emeralds, rubies and sapphires, for which the island has been famous, and which earned for its ancient name of Ratnadvipa.The peak pilgrimage season is in April, and the goal is to be on top of the mountain at sunrise, when the distinctive shape of the mountain casts a triangular shadow on the surrounding plain and can be seen to move quickly downward as the sun rises.Climbing at night can be a remarkable experience, with the lights of the path leading up and into the stars overhead. There are rest stops along the way.The mountain is most often scaled from December to May. During other months it is hard to climb the mountain due to very heavy rain, extreme wind, and thick mist.For Buddhists, the footprint mark is the left foot of the Buddha, left behind when Buddha visited Sri Lanka, as a symbol for worship at the invitation of Buddhist God Saman.Access to the mountain is possible by 6 trails: Ratnapura-Palabaddala, Hatton-Nallathanni, Kuruwita-Erathna, Murraywatte, Mookuwatte & Malimboda. The Nallathanni & Palabaddala routes are most favored by those undertaking the climb, while the Kuruwita-Erathna trail is used less often; these trails are linked to major cities or town by bus, accounting for their popular use.The Murraywatte, Mookuwatte & Malimboda routes are hardly used, but do intersect with the Palabaddala road midway through the ascent.The usual route taken by most pilgrims is ascent via Hatton and descent via Ratnapura; although the Hatton trail is the steepest, it is also shorter than any of the other trails by approximately five kilometers.Sri pada season begin in December and it is end in May. The January to March period is particularly busy time to climb.Most people starting this journey Dalhousie call nallathanni. nallathanni is 3 hours from hatton.• Buses- In peak season might be two direct buses from kandy. Otherwise exists local bus from Hatton. You might be required to change bus in Maskeliya (after around 1.5 hours).• Train- The nearest train station is Hatton. Then switch to bus, taxi, tuktuk.• Taxi- Depending on your negotiation skills, a taxi (7 seats) around LKR2000-3000.• TukTuk- Depending on your negotiation skills. Around LKR600."},
{"town": "Ampara", "place": "Okanda Devalaya ( A Destination of Mass Pilgrim)", "description": "Situated on the Kumana Panama jungle path Okanda Devalaya is believed to be the location God Skanda first sailed into Sri Lanka in a golden boat. The boat, which was turned into a rock, still stands on the Okanda beach known to all as the ‘Ran Oru Gala’.Held in reverence by many without the difference of a religion, race or creed the temple’s origin is unknown although the signs of an ancient monastery are found nearby. Archeologists believe the temple being situated near the ancient Okanda harbor too would have increased its importance with many a seafaring men seeking its help before and after a journey.Although the ancient devalaya was of much simpler structure and adornment the present temple imitates a more Southern Indian Kovil structure due to its large number of Tamil Hindu devotees. Earnest devotees of Kataragama by the thousands, hailing from all communities but especially Tamil Hindus undertakes anannualPâdaYâtrâ or foot pilgrimage via Okanda temple and Yala National Park to Kataragama for theEsala festivities in Kataragama.Nearly 30,000 pilgrims from the Northern and Eastern coasts of Sri Lanka arrives in procession at Okanda to commence weeks long walk through Yala National Park to the temple of God Skanda in Kataragama. The devotees pray for Lord Skanda’s blessings and assistance prior to commencing their journey through the thick jungles of yala amidst the wild beasts of prey.The ones who walk from afar are those who savor the traditional pilgrim’s life of sleeping in temples and under the open sky, accepting whatever alms that strangers may offer, and bearing up under scorching sun while walking barefoot on searing hot roads, clad only in simple pilgrim’s garb with a small bundle of offerings and belongings balanced upon their heads. All along the way, villagers await their chance to offer dâna to the small bands of swâmis and swâmiammas.For many pilgrims the PâdaYâtrâ is a chance to visit ancient shrines all the way to Kataragama in the company of veteran devotees. Their long trek takes them to famous temples at Sittandy, Mamamgam, Kaluthavalai, and Mandur in Batticaloa District. In Ampara District they follow the coast via Tirukkovil, Pottuvil and Okanda through Yala National Park to reach Kataragama.Things To Do: Pilgrimage, sightseeing, photography, hiking"},
{"town": "Nuwara Eliya", "place": "Victoria Park", "description": "It is located in 165 kilometers away from Colombo. Originally the park was the research field of Hakgala Botanical Garden. The park was formally named in 1897 to commemorate Queen Victoria's Diamond Jubilee (60th Jubilee). The park was established with the planting of its first tree, an Oak, by a visiting German Princess in Last part of the 19th century. The Nanu Oya River runs through the park, creating a number of small scenic lakes that greatly enhance the park's natural beauty.A large number of rare bird species can be found in the park. Victoria Park is an attractive and well used Place. It is popular with ornithologists, students and people how interest in birds can spend their times in this park. They can get good chances of seeing Indian Blue Robin, Thrush Pled or Scaly Thrush hiding in the dense undergrowth. Kashmir Flycatcher is another attractive bird species found in the park. At the far end of the park is a small children's playground and miniature ridable railway."},
{"town": "Ampara", "place": "Magul Maha temple (Magul Maha viharaya)", "description": "Meditation, Pilgrimage,Photography, Archeology.It is a place where history was made when the daughter of King Kelanitissa, the ruler of the Kelaniya kingdom married the King of Rohana, King Kavantissa, which unified the southern parts of Sri Lanka in the Second Century BC.Built to celebrate this union which was to change the face of Sri Lankan history forever, MagulMahaViharaya hosts many characteristics not found in many a temple.Situated in Lahugala, amidst an elephant infested forest reserve of LahugalaKithulana, MagulMahaViharaya carries the look of a lost city hidden amidst the towering trees of the jungle.The 200-acre archaeological site scattered with temple complexes and granaries sets it apart from any other temple and had been the home to 12,000 arahants some 2000 years ago. It also had been designed to serve the purpose of a monastery and a fortress where food, weapons and animals were kept in preparation for the Dutugemunu-Elara war fought against an invading Tamil King from South India. The temple complex itself consists of three courtyards, exterior, interior and centre. The outer yard comprises a heavy stone wall with seven ponds which provided water to the temple. The interior was house to the bhikshus who inhabited the temple, while the central courtyard comprises of the main interests of the temple."},
{"town": "Ratnapura", "place": "Balla Mala Ella", "description": "This waterfall, formerly known as ‘Karawita Ella’flows down theUdakarawitamountain. Legend has it that one day a British planter,followed by his faithful dog, visited the falls to capture some photographs. Unfortunately, the excited dog lost its footing and plummeted into the base of the waterfall and drowned. A nobleman named D G Siridoris witnessed this event, and from then on referred to it as ‘Balla Mala Ella’, which means ‘the waterfall in which the dog died.’The Balla Mala Ella is 174 feet in height and divides into to three chutes at the base of the waterfall. The water gushes over a bed of flat rock and joins the Delvalariver. The area surrounding Balla Mala Ella consists of large flat rocks, a natural water pool, many timber trees and medicinal plants."},
{"town": "Kurunegala", "place": "Nikayalannuwara Historical Temple", "description": "The Nikayalannuwara temple was one of the first temples built in honour of Arahat Mihindu Thera’s visit to Sri Lanka. He arrived in the island to introduce Buddhist philosophy to the then ruling King Devanampiyatissa. Arahat Mihindu was the son of Emperor Asoka of India. Temples were built across the area 7 miles apart to mark this momentous occasion and it is believed that these temples including the Nikayalannuwra Historical temple house sacred relics.The temple has 3 ancient stone inscriptions that give historic details regarding Mihindu Arahat Thera, King Devanampiyatissa and King Mihindu the 6th.As this historic temple belongs to the very early period it has some very valuable artifacts within its premises. The temple plus the artifacts are being restored by the Archeological Department. This place is a must visit for those making the journey to Panduwasnuwara in the Kurunegala district. Panduwasnuwara was the Kingdom of the second king of Sri Lanka King Panduwadewa. Visitors can enjoy the calming effects of the beautiful surroundings of the Nikayalannuwara temple, while from the NikaslanuwaraHill they can enjoy panoramic views of the surroundings."},
{"town": "Jaffna", "place": "Delft Biobab Tree", "description": "The Baobab trees are another legacy of the Portuguese who brought it here for medicinal purposes for the horses. There are several Baobab trees in the island, each believed to be 300-400 years old. One in particular is unique as the trunk has a hollow large enough to walk into.Two men can stand abreast in the entrance. Baobab (Adansonia) is native to Madagascar, Australia and Africa."},
{"town": "Ratnapura", "place": "Diva Guhawa - Batatota Lena", "description": "The Batathota cave houses an ancient temple and is a popular place of Buddhist pilgrimage, which is quite evident by the provisions made for the continuous stream of pilgrims that visit these precincts. A huge vehicle park and rows of stalls selling all kinds of everything marks the entrance of the climb up to the cave temple.Rock cut stone steps mark the route, and there are hand railings in some places for the convenience of pilgrims. The path is under a canopy of trees. Simple ferns grow from the damp rock roof of the cave giving the impression of green chandeliers. These ferns are like a wondrous gift of nature.The cave at the top, facing the Sri Pada maluwa, is huge with a high roof, airy and full of light. At the entrance there is a pond filled with fish, called the Manduka Vila. A huge frog made of cement adorns the centre. Towards the back of the cave is the temple shrine room, a dagoba and a small Devalaya.An attractive Makara Thorana adorns the entrance to the shrine room. Inside is a 21 cubit reclining Buddha statue, believed to have been constructed during the days of King Nissankamalla. Behind the statue are some interesting paintings. They depict a crowd of Arahats standing amongst the clouds. In their hands they hold bunches of Sal flowers.It is believed that these sacred precincts were established by King Walagambahu, to whom most cave temples are attributed.There is also a further belief that Diwaguha or Bhagawalena, associated with the Lord Buddha’s visit to Lanka, referred to this place. The most venerable Agga Maha Pandith, the Balangoda Ananda Maithriee Thero, having examined the surroundings, the frescoes in the shrine room, cave lore and beliefs of the area, was of the opinion that this was the most likely spot that could be identified as the Divaguhava where the Lord Buddha rested on his visit to the sacred mountain, the Sri Pada. The historic cave temple of Batathota Lena can be reached by travelling approximately 7 kms along the Kuruwita Eratna Road, proceeding a further 1 km at the Batatota Junction up to the Batathota School, and a further ¾ km along the road."},
{"town": "Ampara", "place": "Kudagala Forest Reserve & Monastery", "description": "Known as the Kuda-sigiriya for its drip ledged caves adorned with murals Kudagala had been a monastery for the last two thousand years. Situated few miles away from Dehiattakandiya Kudagala is a three hundred meter tall mountain in a range that governs the horizon on the Weheragala road.Although most of the caves had been designed as abodes for the meditating monks and had been sponsored by a group of merchants, in the area, according to a rock inscription found on a rock table, one cave carries the remnants of murals drawn on a specially laid plaster inside a cave designed to be a shrine room. The murals drawn with natural colors mainly illustrate red, orange, green and brown and have been polished over with a natural wax to safeguard then from rain and glare.The design created with lotus flowers and vines is the only remaining part of a mural, which had once covered the whole ceiling of the cave. A new plaster had been laid over some parts of the mural while some parts, alleged to be comprising a picture of a bodhisattva had been covered with a white paint, done by the ignorant at the beginning of the last century.The entrance to the cave faces a steep slope and has a natural rock terrace which affords a view of the Mahaweli River and the Hunnasgiriya mountain range. The small holes on floor of the cave would have been made to support the wooden roof, which would have sheltered the cave entrance and the Buddha statue, which lay in ruins today. Remnants of a stupa, which would have been once visible to the whole valley below, stands on the top of the mountain, pillaged by treasure hunters while it’s top and bricks lay strewn around.Archeology, photography, hiking, wildlife, sightseeing, pilgrimage."},
{"town": "Trincomalee", "place": "Pigeon Island National Park", "description": "The national park contains some of the best remaining coral reefs of Sri Lanka. This national park is the 17th in Sri Lanka. The island was used as a shooting range during the colonial era. Pigeon Island is one of the several protected areas affected by the Indian Ocean tsunami in 2004.Pigeon Island consists of two islands; large pigeon island and small pigeon island. The large pigeon island is fringed by a coral reef, and is about 200 m long and 100 m wide. The national park is situated within the dry zone of Sri Lanka. You can see over 100 species of coral and 300 coral reef fish recorded in the area. Sea Turtles and Blacktip Reef Sharks are also commonly seen in the shallow coral areas.To reach Pigeon Island National Park, visitors must rent a boat from Nilaveli Beach and then take a one hour trip to the island. The charges for visiting Pigeon Island National Park entry fee adult/child US$10/5, service charge per group US$8 and charge per boat Rs 125.There are boat operators who will charge Rs 1500/- 1800/- for a return trip to the island. These can be organised outside hotel arrangements. The islands are looked after by the Navy. You can visit the Pigeon Island National Park every day from 9 a.m. to 5 p.m. You can also buy goggles and other swimming equipments."},
{"town": "Colombo", "place": "Colombo Gold Center", "description": "Colombo Gold Centre is the best place to buy Golds and Gem jewelries. You Can buy different products in different stores. In here there have various gem and Jewelries shops. This Gold Centre consist with two Floors. In second floor, you have able to find Gem Authority Branch, in here therefore can checked that gems you buy.You can find the Gold Center very close to the Sea Street. Gold center open 9.00am to 8.00pm daily"},
{"town": "Jaffna", "place": "The Nagapooshani Amman Kovil", "description": "Situated in the isle of Nagadeepa just thirty km form the Jaffna peninsula, Shree Nagapooshani (Bhuvaneswari) Amman Hindu Temple is wrapped in thousand years of myth and legend.Dedicated to Parvati who is known as Nagapooshani and her consort, Shiva , the temple was shot to fame by Adi Shankaracharya, a 9th century Hindu philosopher, who identified it as one of the prominent 64 Shakti Peethams or places of worship consecrated to the goddess Shakti inBrahmanda Purana.The legend holds that Goddess Sati, consort of Lord Shiva immolated herself in shame and pain that her husband was being abused by her father. Her body was shattered to 64 pieces and her anklet is believed to have fallen on to the place where the temple is.Believed to have been established by Lord Indra himself the temple is believed to have been built by a Chola merchant travelling from India to Sri Lanka. The old temple had been mentioned in Tamil epics Manimekalai andKundalakesi.However the original structure was destroyed by the Portuguese along with the Rajayathana stupa and the new temple was built during the 18 thcentury. The temple complex houses four gateway towers or gopurams, with the tallest tower been the RajaRajagopuram, which is 108 feet high. Built nearly one year ago it is the largest of its kind in the country and has 2000 sculptures on its four sides.The most important festival associated with the temple is the 16 day long Mahostavam (Thiruvizha) that is celebrated in annually in the June/July and is attended by thousands of devotees streaming in from Sri Lanka and India."},
{"town": "Gampaha", "place": "Gampaha Wickramarachchi Ayurweda Hospital", "description": "Things To DoVisit Ayurwedha Treatments , Ayurwedha Study.Located in Yakkala nearly thirty km from Colombo, Gampaha Wickremarachchi Ayurveda Institute was established in 1929 as the Siddharyuveda Vidyala to disseminate the then lesser known information on Ayurveda, a traditional medicine system native to India and Sri Lanka.Pioneered by late Panditha Gabriel Perera Wickramarachchi whose dream was to establish a Ayurveda training school in Sri Lanka similar to his Alma Mater, prestigious Jamini Bhushana Ashtanga Ayurveda Institution in Calcutta; the Ayurveda Institute was humble school of Ayurveda funded and taught by Wickramarachchi and a group of like mineded ayurvedic doctors in the area. The students were taught free of charge and were many a time assisted with lodging by the philanthropic well-wishers and teachers."},
{"town": "Galle", "place": "Mirissa", "description": "Mirissa is the largest fishing port on the south coast and is known for its tuna, mullet, snapper and butterfish. In 1980 the first tourist accommodation was built however it wasn't until the mid-1990s that tourism to the town started to dramatically increase.Best time to visit- Winter Season: November - April The beaches are at their best at this time with fine weather and calm seas. Summer Season: May – October During the off season, Mirissa becomes quiet and sea gets a bit rough but it is still popular especially at weekends with crowds from Colombo coming to spend the day here. Whale and dolphin watching: there are many companies with different prices (2000-6000 LKR), but in the end all of them are similar, and you will be surrounded by another 12 boats while hunting the animals. You can easily get good views of dolphins, as they will be in a big group jumping out of the water for a long time, but don't expect much from the whales: they are elusive, and you'll most likely only see a bit of their back for a brief second when they come out for air. The boats will chase them around until you get four or five of these sightings, and then head back home. If the engine doesn't fail, you'll be boarding at 6:30, leave the harbour at 7:00, and be back by 11:00. Some boats have plastic chairs, others have benches, others have mattresses on the upper deck floor. Check the boat at the harbour, ask how many people will be on board, and avoid overcrowding. All of them include a cup of coffee or tea, a small bottle of water, some breakfast (jam sandwich), bananas, pineapple and watermelon."},
{"town": "Colombo", "place": "Diyatha Uyana", "description": "This park built in the banks of the Diyawanna Oya. You can walk around the park and you can find out beautiful flower and plants along the way. Riverside also beautiful place in Diyatha Uyana Park, you must try a boat ride, it will very enjoyable to you.This park decorated with fish tanks and flowers and you have able to buy those beautiful flowers.You can find out a park restaurant “Diyatha Uyana Food Court” at the Park entrance. It Provides variety of foods and drinks.This Diyatha Uyana park built on swampy land between the parliament complex and the Diyawanna Oya and the Polduwa Junction. This Park close to “Waters Edge Hotel”If you come here to from Pettah, Colombo it has 10km and it will take 30 or 45 minute."},
{"town": "Kurunegala", "place": "Rambodagalla Buddha Statue", "description": "In the tranquil village of Rambadagalla in Ridigama in the Kurunegala District, a huge stone sculpture is taking shape.Rambodagalla Buddha Statueis no ordinary sculpture but one modeled on the Bamiyan Buddha in Afghanistan which was destroyed by the Taleban in 2001.Things To Do: Pilgrimage, Photography, Educational, Cycling"},
{"town": "Colombo", "place": "Green path Colombo", "description": "Green path Colombo, formerly Ananda Coomaraswamy Mawatha street that popular for open air events and festive. In every weekend in here maintain art exhibitions. “Kala Pola” is a best example for art exhibition maintain in here. You can buy some paintings in here. Many Sri Lankan artist perfomed their talent in here.Food festival also a cultural festival that annually held on here. You can taste Sri Lankan cultural foods.This street located near to Colombo Art Gallery.Green-path or Ananda Coomaraswamy Mawatha is a broad two-way traffic road that outlines the southern end of Viharamadevi park."},
{"town": "Bandarawela", "place": "Dowa Rock Temple", "description": "The Dhowa rock temple is famous for its large unfinished Buddha image, carved into the rock face, which is considered an example of Mahayana sculpture. The 12 m (39 ft.) rock carved Buddha statue and the ornamental gateway are the main attractions of the temple. The statue is in a state of ruin due to rapid decaying.Folk tales hold that the half-finished Buddha statue was carved by King Walagamba himself while hiding in this caves during foreign invasions. The king is said to have left the area before he could finish carving the statue, thus leaving it half finished.The paintings of the shrine room had been decorated with the influence of the Kandyan era. These paintings depict various Jathaka stories (Jathaka stories mean education stories of past births of the Lord Buddha). The canopy of the rock is decked with paintings of lotus and various other flowers. Among these paintings, the Ath-Gon Satana (battle between a tusker and a bull) is featured. The priority had been given to the cobra image in the structure of the temple. The cobra had been featured in the paintings as well as on the jug used for serving water to Buddha.Many travelers are attracted to the temple because of its quiet and beautiful surroundings.It is a protected heritage site in Sri Lanka, situated in the central mountains of the Uva province. Dhowa is a small, ancient village situated on the Badulla - Bandarawela main road. This temple is situated 210 km (130 mi) east of Colombo and 120 km (75 mi) south of Kandy.You can reach to Dowa temple from Colombo, Awissawella, Ratnapura, Balangoda, Bandarawela and Dowa Temple. This tour take almost 5 hours."},
{"town": "Kandy", "place": "Sri Dalada Maligawa (Temple of the Tooth)", "description": "After the parinirvana of Gautama Buddha, the tooth relic was preserved in Kalinga and smuggled to the island by Princess Hemamali and her husband, Prince Dantha on the instructions of her father King Guhasiva.The Sacred Tooth Relic, which is the Buddha’s left canine was brought here during the reign of king Kithsiri Meghavanna (301-328 B.C.) by Prince Danta and Princess Hemamala from the Kingdom of Kalinga, India.The temple is open from dawn to dusk. It houses a tooth relic of the Lord Buddha, and is consequently considered one of Sri Lanka's most holy shrines. Although you may not view the actual tooth itself, the casket within which it is said to be is displayed twice a day. The best time to view this ornate casket is around 6.30PM Make sure to cover up below the knees with pants and everything on the shoulders. There are plenty of people at the entrance that will hire you a shoal to cover for 150 to 200 LKR.There is also a foreigner only shoe drop just before you enter the temple where they ask for a donation. there is a local shoe drop for free behind it so don't feel like you need to give a donation as you have already had to pay 1,000 LKR. Foreigner entrance: LKR1,000. The Pooja times are 6.30 AM, 9.30 AM and 6.30 PM. There are two sides to this – some prefer to see the Temple during a Pooja, a small ceremony of reverence involving drummers and dancers – there are more people during this time."},
{"town": "Badulla", "place": "Diyaluma  Falls", "description": "On one side of cascades, the earth is covered with deciduous plants. Wild animals found in the area include lizards.In Sinhalese, Diyaluma or Diya Haluma means \"rapid flow of water\" or may be translated as \"liquid light\". According to Sri Lankan historian, Dr. R. L. Brohier, Diyaluma is the setting of the folklore about a tragedy involving a young chieftain who had been banished to the highlands and the attempt by his betrothed to join.As all the passes were guarded the young man let down a rope of twisted creepers over the escarpment, as she was hauled up she was dashed against the rocks and died. The Gods, moved to pity by the harrowing spectacle, caused a stream of water to gush from the mountain and veil all evidence of the tragedy in a watery light, hence the term Diyaluma.At 171 m, Diyaluma Ella Falls is the third largest waterfall in Sri Lanka. The torrent of water cascades to the plateau of Koslanda and during the rain, it is a spectacular view.Cascades is located along the Koslanda-Wellawaya road in the district of Badulla. Koslanda is the closest town in the fall, 6 km, and Wellawaya is 13 km."},
{"town": "Ampara", "place": "Arugambay & Pottuvil Point", "description": "Arugam Bay is a page from a surfer's dream book where the shore is white and wide, surf is high and the waters clear and un-spoilt beach line stretching for miles.The best, lesser known and hard to get is the Peanut Farm to where the journey takes you through a forest in habited with elephants. Nearly a 20 minutes drive through the forest brings you to the clearest and the most beautiful beach ever to be created.Arugam Bay is a page from a surfer's dream book where the shore is white and wide, surf is high and the waters clear and un-spoilt beach line stretching for miles.Arugam Bay is at its best at sunrise when the sky and the beach provide a festival of colours. Fishing boats returning after the night catch, famous jumping fishes heading towards the beach and fisherman waiting with baited lines all join hands to make the perfect picture of a day break.Most of the people in Pottuvil are fisherman and have returned to their vocation with the dawn of peace. Thus, Pottuvil is also the seafood paradise today with delicacies like prawns, cuttlefish and crabs available at every food outlet!The beaches are also ideal for sea baths although the waves could be too strong for an amateur.The surfing season in Arugam Bay starts in April and ends in October. There are four main surf points in Arugam Bay including Arugam Point and Crocodile Rock. Although all of them provide diverse experience of the sea, the sand and surf the ultimate experience is the Peanut Farm or Pottuvil Point.A long, deserted, sandy beach dotted with some huge boulders at the water’s edge make these waves a favorite with some of the seasoned veterans. Pottuvil Point provides 800 metre rides from the outside section right through to the beach on the inside.The magic about these waves is that for the most of it, a surfer can be working a four foot face and be only a few metres from the beach as the wave grinds down the sandy point. The outside section sucks up and throws out as the swell raps into the point giving a 30 metre wall to work with before it fades as it hits deeper water for about 10 seconds. The surf increases into the day so be sure to be at beach by ten in the morning.Surfers and visitors are often helped and hosted by small communities of fishermen who live in wooden huts among the forest and who are also keen to maintain the beach which is still heavenly.Things To Do : Surfing, Sea Bathing, Photography, Sight seeing"},
{"town": "Bandarawela", "place": "Bambarakanda Falls", "description": "Bambarakanda Falls is the tallest waterfall in Sri Lanka. With a height of 263 m (863 ft.), it ranks as the 299th highest waterfall in the world.It is not a wide waterfall, but descends like a thin line of a rocky outcrop. The fall is formed by the Uduweriya Haputale and Kuda Oya, a tributary of the Walawe River.Situated in Kalupahana in the Badulla District, this waterfall is 5 km away from the A4 Highway. The waterfall was formed by Kuda Oya, which is a branch of the Walawe River. The Bambarakanda Falls can be found in a forest of pine trees.The trip to the falls is identified by a small sign. Travel along this curved road for about 3.5 km where you will arrive at the place where autumn is directly visible on your left.This path is very narrow, watered and full of pot holes. A four-wheel drive is recommended because a pickup truck with a high ground height could get there. The base of the fall is a few hundred meters from the road, and no clear path is available to get there. Travel time from Kalupahana approximately 30-40 minutes due to the state of the road."},
{"town": "Ampara", "place": "Kudumbigala Monastery", "description": "Situated within the Northern parts of the Ruhuna National Wildlife Park and a short distance from the Eastern beach of panama, Kudumbigala is a monastery of more than 200 cave accommodations.Initially designed to house the meditating arhants of Anuradhapura from the hustle and bustle of the urban life, Kudumbigala reached its glorious peak during the time of King Dutugamunu in the first century BC.The one of a kind cylindrical shape stupa on the top of the mountain can be reached through steps carved on to the mountain. Many other stupas of the same unique shape but of smaller size lies in ruin within the monastery premises and are believed to enshrining the remains of the arhants.Things to Do: The magnificent monastery of the Digamadulla"},
{"town": "Ampara", "place": "Jayanthi Wewa", "description": "Built damming the water of Pallan Oya River Jayanthi Wawa near the towering Wandinagala is an idyllic sight in an evening scattered with a few fishing boats and the ever present elephants around it gathered for a dip.Built in 1960 to the south of Senanayaka Samudraya Jayanthi Wawa stores nearly 93,000 square acres of water, irrigating fields of paddy and sugar cane. It is also source of livelihood to freshwater fisherman and provides drinking water to the Ampara district.The reservoir is a source of water to the elephant herds who roam the bordering Gal Oya National Wildlife Park and the flocks of bird like Little Cormorant, Malayan Night Heron, Lesser Whistling-duck and spot billed pelican, who gather at the reservoir in search of food and nesting ground.The elephants also roam the mountain of Wadinagala, which stands 2400 feet tall challenging the brave and the reckless.It is famed to be a mountain, one considered as an alternative to bear the foot mark of Lord Buddha and its heritage in ancient Buddhism is visible in many ruins scattered around the mountain. Beautiful guard stones, rocks pillars and moonstones lie amidst the towering forest of ebony and satinwood, which is been plundered by treasure hunters and illegal loggers to whom Wadanagala had become a heaven of profit.Being the second highest peak of the Gal Oya sanctuary, the climb towards the peak is perilous and should be undertaken with an experienced guide as the mountain is streaming with wild elephants.Things To Do - Sightseeing, Elephant Watching, Bird Watching, Photography, Hiking"},
{"town": "Gampaha", "place": "Weweldeniya", "description": "Buying Cane CraftsOn the road to Kandy from Colombo is a small township with a line of boutiques selling cane and rattan furniture to the local and foreign passersby.Known as Wewaldeniya for its use of Wewal or cane for manufacturing household containers to furniture and ornaments, the village is a heaven of useful utensils and tidbits for a home. May it be a cane garden chair set, a flower vase, kitchen baskets, a picnic basket or a pouch swing; weweldeniya has the product in your mind intricately and carefully woven and produced in rattan and cane.The boutiques also display traditionally woven and colored mats, coir and ekel based products and pottery of fine quality made according to an age old tradition. Created by traditional industrialists from the cane brought from Manampitiya, Bibile and Trincomalee or imported from Malaysia the prices of the products had increased during the last few years due to the scarcity of the raw materials and the shift of market from small scale manufacturers to large scale producers."},
{"town": "Colombo", "place": "Seema Malakaya Meditation Centre", "description": "This is a temple that belongs to Gangaramaya temple. This beautiful place designed by one of Sri Lankan best architect Geoffrey Bawa. This temple located in the middle of the lake. This temple covered with a short white wall and on this wall numerous statues of Buddha sitting in different poses. On your visit, stop walking and sit down. Enjoy the calm of being on the water. The hustle and bustle of the city, although close, seems to be a lesson. In the afternoon, this place bright with colourful lights.This place located near to well-known Ganagaramaya temple. You can hire tuk from here to “Sir James Pieris Mawatha” You will be able to see the water temple from that location."},
{"town": "Kurunegala", "place": "Ratmullukanda Viharaya", "description": "Located in close vicinity to Panduwasnuwara in the Kurunegala district the Ratmullukanda Viharaya is situated on the Ratmullukanda hill. The highest peak where the Viharaya or temple is situated can be reached by vehicle, so visitors old and young alike can visit the temple without any problems. At the highest point of the nearly 1000 ft high hill there is massive Buddha statue that is a beautiful sight to behold. Further visitors can enjoy amazing panoramic views of the surrounding area from this vantage point. The Ratmullukanda Viharaya is an interesting place for both local and foreign visitors."},
{"town": "Colombo", "place": "Lionel Wendt Art Centre", "description": "The Lionel Wendt Art Centre offers two potions, a gallery and a fully equipped theatre with more than 600 seats. The Lionel Wendt Art Centre is the main venue for art and theatre exhibitions (especially English theatre) and other artistic events.The Lionel Wendt Art Centre has been the main venue for art exhibitions and theatre (especially English theatre) and for other artistic events for a long time. In addition, the exhibition hall on the ground floor is devoted to artisanal, craft and furniture exhibitions. Large musical theatre productions are usually held at the Lionel Wendt Theatre because of its best installations.This place located in premasiri khemadasa mawatha, Colombo. "},
{"town": "Batticaloa", "place": "Arugam Bay", "description": "Arugam Bay is on the list of the top ten surf points in the world. The best time of the year is between May and November. In Arugam Bay there are three point breaks “The Point”, “Pottuvil Point” and “Crocodile Rock” are within a hour tuk tuk ride from the Hotel, with The Point being visible (15 min walk) from the hotel.dunes. The very first international surfing competition was held by ISA (International Surfing Association) in the summer of 2004 and the surfing season in Arugambay is from beginning of April and ends of October."},
{"town": "Ampara", "place": "Kotaveheragala", "description": "The legend that surrounds the birth of King Dutugamunu relates a story of a novice monk, who lived in a temple called KotapabbathaVihara, who was building a road to the ‘AkasaChethiyta’ or the stupa in the sky. The monk had fallen gravely ill due to his exercise and was later transferred to ‘Seelapassaya Pirivena’, where at his death bed he was bade by the King of Rohana, Kawanthisa and his queen Maya to be born as their first son, after his demise.However the mythical and supernatural form of this story had not prevented the archeologists from searching the fabled ‘Kotaweheragala’ temple with a Stupa built on a mountain peak and Kotaweheragala in Yalpotha, Lahugala is a leading contender to be the fabled home of the novice monk, who was born again to save a nation.Few miles from the Yalapotha village standing amidst the forest is the Kotaweheragala, a ruined temple with a derelict stupa standing on a rocky mountain. The stupa vandalized by treasure hunters is a pile of bricks today. Yet the bricks are identified to be of third to first century BC and are similar to bricks used in Shasthrawela and other temples found in the area. However the link between the mythical ‘KotapabbathaVihara’ and the ruins in Yalapotha is made through a small stone inscription found at the foot of the 150 steps long stairway leading to the stupa on the top of the rock. The inscription states that the rock stairway was made by a novice monk ‘wachigamakahiTherasa’. Is this the stairway built by the novice monk leading to the ‘Akasa chetiya’? Some archeologists believe so, although yet to be ascertained through further archeological investigation.Things to do: Archeology, History, Pilgrimage, Sightseeing, Photography."},
{"town": "Ampara", "place": "Omunugala Cave Monastery", "description": "Omunugala, a cave monastery built in the third century BC which later flourished into a monastery complex under the patron ship of kings and peasants of Eastern Sri Lanka lies destitute in the midst of Mahaoya jungleSpreading around the Omunugala Mountain, named such for an ancient dam constructed around a water fall, the monastery had declined with the Eastern Kingdom as was revived in 1973 yet was lost to the jungle again with separatist war ravaged the Eastern Province.An ancient Bo tree and a tamarind tree stands near the ruined stupa at the foot of the mountain, although the Bodhigara, or the housing around the Bo tree, had been reduced to mere stone pillars few centuries back.Just beyond the Bo tree is the famed ‘Nai Pena Ella’ or the waterfall of cobra hoods named for the sign of seven hooded cobra marked on its rocky banks. The seven hooded cobra is an ancient sign depicting an eternal source of water as the ancient believed the cobra to be the guardian of all water sources.More drip-ledged caves with Brahmin inscriptions detailing donation and donator could be found on the way to the top. The most important inscription is within the largest cave in the monastery. It speaks of the donator as ‘Guptha, the daughter of NadikaMitha and the wife of Thilakana’ and is believed to a cave donation made by the daughter of Nadimithra, one of the ten great warriors of King Dutugamunu.A shrine roomhad been created within a thirty seven meter long cave. The cave remodeled with bricked walls and had been plastered and adorned with murals although few of the adornments remain. A siting Buddha has graced the wall opposite the main entrance but today only the ‘hettuthorana’ or wall pandal built around the statue remain. Although partially destroyed the drawing of the panadal still remain clearThings To Do: Archeology, photography and hiking"},
{"town": "Ampara", "place": "Owagiriya Ancient Monastery", "description": "Built in the second century BC, the Owagiriya ancient monastery is being given a fresh breath of life with the commencing of archeological excavations on site revealing a rich heritage in an era gone by.A rock plateau carved with steps leads to the inside of the monastery, which would have housed hundreds of Arhants and has the remaining of stone constructions, that would have once been meditation chambers, preaching halls, alms halls, kitchens and hostels.Many ruins including rocks pillars of various sizes, moonstones, guard stones, Korawakgalor rock stairway railings were abandoned to the nature and time until rescued by the archeological department in 2008. The excavations had recently unearthed the ancient ovagiriya stupa, which the legends hold to contain the sacred relics of Lord Buddha and hundred other arhants and excavation into the inner chambers of the stupa is on the process.The temple believed to be a creation of King Kawantissa, the ruler of Digamadulla is said to be the temple at which his two sons reconciled after months long dispute over the ownership of the throne. Although no archeological evidence had been found to corroborate this ancient legend, Owagiriya is expected to reveal many historical secrets during the excavations in years to come.Things to Do: Pilgrimage, sightseeing, photography and archeology"},
{"town": "Galle", "place": "Weligama  Bay", "description": "Rated by Forbes magazine as amongst Asia's Best Beaches. In fact a lovely place where local fishermen have adopted an almost unique way of fishing, located on the sri lanka's picturesque south coast.As you approach Weligama along the coast road east from Galle will encounter Sri Lanka's famous stiltfishermen. Each fisherman has a long pole with a crossbar that is stuck in the seabed close to the shore. The fishermen wade or swim out tothese poles at times when the sea and fish are running in the right direction."},
{"town": "Nuwara Eliya", "place": "Devon Falls", "description": "97 meters high Devon waterfall is the 19th highest waterfall in Sri Lanka. The name of the waterfall comes from British coffee planter (Devon) whose plantation is nearby this fall. this is waterfall located in picturesque spot.This waterfall located in Talawakele, Nuwwara- Eliya district. That is 6km from Talawakele. If you want to see Devon waterfall clearly 20th milepost is the best spot. It has parking facilities and special view point only for Devonfalls. You can also see this waterfall at the 10km away from the watagoda railway station."},
{"town": "Kurunegala", "place": "Tomb of King Vijay", "description": "Wijaya cemetery sitituated in Medagama Kanda in the gramaniladhari division of Kandemedagama in the divisional secretariat division of Hettepola, Kurunegala district North Western ProvinceThings To Do - Pilgrimage, photography, sightseeing, hiking"},
{"town": "Colombo", "place": "Colombo Racecourse", "description": "Race course is a beautiful bright white place to relax. In the racecourse, you can find out the variety of food shops, handicrafts, electronics, clothes and accessories.This Race course building design as British-style architecture.Race course ground now used for rugby, and mostly animal friendly activities.This field was also used as an airstrip during World War Two.This place located in Philip Gundawardane mawatha. Racaecourse Ground located about 6km away from Fort Railway Station."},
{"town": "Trincomalee", "place": "Nilaveli and Uppaveli", "description": "The Bay of Trincomalee's harbor is renowned forits large size and security; unlike every other in the Indian Sea, it is accessible to all types of craft in all weathers. The beaches are used for surfing,scuba diving, fishing and whale watching. The city also has the largest Dutch fort in Sri Lanka. It is home to major Sri Lankan naval bases and aSri Lankan Air Force base.On the North East Coast of Sri Lanka, Nilaveli is a pristine covered with white sands and gentle waves slip softly to shore and is the ultimategetaway for those who wish for quiet bliss on a tropical heaven, far away from the cares of life.Uppaveli is one of beautiful, sensible and calm beach closer to Trincomalee with plenty of fairly comfortable accommodation options."},
{"town": "Kandy", "place": "Bahirawa Kanda", "description": "Travel approximately 3 kms via Pushpadana Road in Kandy, in the ascending direction passing Pushpadana Balika Vidyalaya to reach Bahirawa Kanda.The mountain is 650 feet above the Kandy town and this remarkable location is of special significance to Buddhists. An 88-foot standing Buddha statue is seen on its summit, facing the Dalada Maligawa. There is an abundance of stories in folklore about the name Bahirawa Kanda. A southward branch of the Sri Maha Bodhi was planted on this mountain summit, and a Ran Weta erected around it.Dedicated since the olden times to a demon/deity known in folklore as ‘Bhairava,’ this has been a venue for animal sacrifices for protection from ‘evil influences’ according to superstitions, even to the extent of making the occasional human sacrifice. The last such ‘virgin’ sacrifice on the mountain was Welikala Menike, according to legends. The story, however, goes on to explain that she in fact was rescued by Lunuwila Nilame, her lover. The role of the demon Bhairava, according to the story, was personified by the King’s Chief Purohitha (counsellor). Once his true identity was revealed, the Yaaga (sacrifice ritual) was suspended forthwith and the Dynasty resolved to rectify their ways of governance."},
{"town": "Ampara", "place": "Mullikulamalai", "description": "Once a great monastery of Bikkhunis, The Batuwawu Kanda monastery stands abandoned, destroyed and desecrated amidst the jungles that covers the ruins today.Situated miles away from Deegawapiya the Batuwawu Kanda or Mullikulamalai is an unassuming rocky mountain the tallest middle of a three peak mountain range. Yet the climb upwards amidst towering rock boulders reveals a stone stairway leading upwards towards the stone foundation of a building, which stands no more.On the second peak is a stupa, destroyed by treasure hunters and another stone stairway leads to two large drip ledged caves and a meditation pavilion. The inscription near the stairway records that it was built by a minister called ‘Sidham’ while the caves carry no inscription.On Eastern face of the mountain are more drip edged caves, which are been destroyed with dynamite. The inscriptions within these caves speaks of no other than Viharamaha Devi, the legendary queen of King Kawanthissa and the mother of Great King DutuGamunu and his brother King Saddatissa .The inscriptions found within the cave at the Batuwawu Kanda speaks of a cave built for a person known as ‘Shavera’, similar to the Madanakanda inscriptions, yet at this stage she is identified as a ‘Shamaniya’ or a Bikkhuni, who is also the mother of the Eastern province ruler and the daughter of Maha-Tissa. Thus the inscription at this drip ledged cave, which is being destroyed by religious extremists, is the only clue to the last years of a great Queen of Sri Lankan history.Things To Do: photography, archeology, hiking and investigation"},
{"town": "Ampara", "place": "Neelagiri Stupa", "description": "Hidden in the vast jungles of Lahugala forest reserve and surrounded by wild elephants is the largest stupa in the Eastern Province of Sri LankaBuilt in the third century BC under patron ship of King Kawanthissa the stupa and the monastery around had been called ‘Uttara Seevali Pabbata Viharaya’ in its glory days.Alleged to be the legendary Maha Nuggala Stupa, where King Kawantissa requestedhis ten chief generals and the maha sanga to be impartial in case of a dispute over the thorn between his two sons, princes Duttugamunu and Saddatissa after his dismissal the Neelagiri stupa according to the archaeology excavations is a part of a larger monastery complex, which flourished in the Eastern province during the times of Tamil takeover of Anuradhapura, the country’s administrative and cultural centre.The two princes after a short battle joined hands to defeat the invading Tamil king Elara. While King Dutugamunu ruled from Anuradhapura, prince Saddatissa converted the Eastern province into the rice bowl of country and rich trading hub.The ruins of stupa are accompanied by a giant cave temple complex scattered in decay. Giant stairways of seven feet width leads to a series of caves carved with drip ledges built initially to house the meditating monks but were later remodelled into a shrine room. The statues hadlong been destroyed by treasure hunters while the smooth surface of the caves inner walls too has been desecrated.Many a smaller stupas lie in ruin among the larger stupa and the cave complex while more caves on the top of the rocks too have ben drip ledged and remodelled to house meditating monks.Forgotten for the last thirty years due to the war that engulfed country’s north and east, the massive stupa lies in a state of ruin today. The remaining structure is 182 meters in circumference and 22 metres in height. The excavations into the stupa, which was launched in 2011, had unearthed two hitherto unknowninscriptions belonging to the first century ACand second century AC detailing the donation by regional queen and a king.The excavations had also unearthed a monastery complex surrounding the stupa across 89 hectares and a golden casket enshrining the remaining of arhants, who once graced this holy ground.Things To Do: Archaeology, Photography, Wildlife, Pilgrimage, Sightseeing, Trekking"},
{"town": "Ampara", "place": "Henanegala Len Viharaya", "description": "Believed to be one of the sixty four temples built by King Kawanthissa, Senanigala shot to fame when his son, great King Dutugamunu, chose the rock monastery to gather his forces against King Elara, a Tamil king who usurped the throne of Anuradhapura.Identified to be one of the two ‘panchavasa’ temples remaining in the country Senanigala holds a stupa, a shrine room, a bodhigara or house around the Bodhi tree, a gathering hall and a preaching hall essential to qualify as a ‘panchavasa’ temple.Scattered around the main temple on the rocky plateau are a compound laid with stone slabs anda ninety five feet long drip-ledged cave,which housed the meditating monks of the eras gone by. Among the broken statues are a five feet tall Buddha image and a six feet statue believed to be of King Datugemunu. A moonstone adorned only with figures of elephants, stairway stones and stone pillars of intricate beauty adores the entrance to the shrine room. The stairway stone or Korawakgal are over five feet tall and are believed to be the tallest found in the country while the shrine room has a two entrance structure unique to Senanigala. A bodhigara or a stone housing built around the Bo tree found near the pond lay in ruins although the stone slabs laid around the Bo tree still remain intact. But the stupa had been completely vandalised by treasure hunters its body carved out and its top taken apart and thrown away. Nothing but a road paved with stones wide enough for two horse chariots to pass abreast still remain at the foot of the mountain as witness to the bustling army organisation that was present in and around Senanigala nearly 2100 years ago.Things to Do: Pilgrimage, photography, hiking, sightseeing and explore"},
{"town": "Ampara", "place": "Piyangala Forest Hermitage", "description": "Built in the First Century BC by the Queen Rajitha, the main wife of King Dutugamunu Piyangala Forest Hermitage remain a monastery up to today standing strong despite the thirty year war that stormed the Eastern Sri Lanka.Built in the First Century BC by the Queen Rajitha, the main wife of King Dutugamunu Piyangala Forest Hermitage remain a monastery up to today standing strong despite the thirty year war that stormed the Eastern Sri Lanka.Situated on a peak, the monastery is small in size compared to the other monasteries in the area. A stone paved path leads to the entrance of the monastery, which consist of a unique 100 feet long walking path designed for meditation. Spread with white sand and paved with granite the path leads way into the forest assisting generations of meditating monks in their pursuit for the end of samsara. A further way up the mountain leads to drip ledged caves of the meditating monks. Simpler in design the caves contain stone inscriptions detailing the donation and donator while some also carry drawings of forest dwelling vedda groups, who made the caves their home after the fall of the original monastery.The main cave of the hermitage known as the ‘Utharaguthatherahalena’ stands top of the mountain accompanied by another 20 odd caves is believed to have been used by a renowned arhant in the East during the first century BC known as, Uttara Gupta Thera.The caves are accompanied by moonstones built in the fourth century and a carved foot mark of Lord Buddha while the Bodhi tree and stupa found in the premises are relatively new compared to ruins scattered around.Spreading over 200 acres of forest land, Piyangalaforest hermitage was the victim of a thirty year old war, rock quarry as well as a series of damning forest fires. Yet it stands even today reminiscent of a monk in Samadhi, who is in harmony with life’s peaks and falls.Things To Do - Meditation, Sightseeing, Hiking, Photography"},
{"town": "Matale", "place": "Wasgamuwa National Park", "description": "Wasgamuwa National Park was declared to protect and to make a refuge for the displaced wild animals during the Mahaweli Development Project in 1984 and is one of the four National Parks designated under the Project. Wasgamuwa is one of protected areas where Sri Lankan Elephants can be seen in large herds. It is also one of the Important Bird Areas in Sri Lanka. The best time to enjoy the view of large herds is from November to May. For the rest of the year, elephants tend to migrate to Minneriya and Kaudulla National Parks. Wasgamuwa National Park exhibits one of the highest biodiversity among the protected areas in Sri Lanka. More than 150 floral species have recorded from the park. Cryptocoryne walkeri and Munronia pumila are two plants with economic value. Reservoirs and riverine forests support large number of fauna species. The forest consists of several layers. Some 1,700 years old tamarind tree, \"Oru Bendi Siyambalawa\" (Sinhala for Canoes-Moored-Tamarind) was situated in the park. Wasgamuwa National Park is home to 23 species of mammals. The park is inhabited by a herd of 150 Sri Lankan elephants. Marsh elephant roams in the Mahaweli river area. Both monkeys found in the park, purple-faced langur and toque macaque, are endemic to Sri Lanka. While water buffalo and Sri Lankan axis deer are common to observe, Sri Lanka leopard and sloth bear are rare. Small golden palm civet is another rare endemic mammal. The number of bird species recorded from the park is 143. This includes 8 endemic species. Endemic red-faced malkoha is a resident bird in this national park. Sri Lanka junglefowl is another endemic bird inhabits the park. Lesser adjutant, yellow-fronted barbet, and Sri Lanka spur fowl are the species that visit the reservoirs and streams of the national park. Peafowl, painted stork, black-headed ibis and Eurasian spoonbill are the park's other aquatic birds. Rare Sri Lanka frogmouth can be found here. Another rare species, chestnut-winged cuckoo, is seen near the Mahaweli river. Endemic and endangered Fejervarya pulla is one of the eight species of amphibians of the park. Of 17 reptile species recorded in the park, five species are endemic. Water monitor and mugger crocodile are common in the waterbodies of the park. Skinks Lankascincus spp., lizards Calotes ceylonensis and Otocryptis wiegmanni, and serpent Chrysopelea taprobanica are the endangered reptile species. Endemic Garra ceylonensis and combtail are among the 17-fish species reside in the aquatic habitats of the park. Of the park's 50 butterflies, eight species are endemic.You can reach to wasgamuwa Nationala Park in hasalaka on the Kandy-Mahiyangana Road and proceed via Wilgamuwa upto Wasgamuwa.The best time to enjoy the view of large herds is from November to May. For the rest of the year, elephants tend to migrate to Minneriya and Kaudulla National Parks."},
{"town": "Gampaha", "place": "Thewatta Besilika Church - National Basilica of Our Lady of Lan", "description": "The statue had received the adoration and worship of the late pope John Paul the sixth in the form of a gold rosary.The Basilica’s high alter is a solid while marble enclosing the relics of holy while the communion table or the altar is made to resemble the Ark of the Covenant and above is a historical 17th Century cross from Puttlam.The undercroft of the basilica contains three burial vaults and another containing the remaining of the late Most Revd. Dr. Thomas Cardinal Cooray. Nearby a man made reservoir amongst two mountain tops and a stream rushing along the forest adds to the charms of basilica and provides a well earned respite to the clergy and faithful who flock to the basilica for prayer and worship.Things To Do: Pilgrimage, Photography , Biking."},
{"town": "Kalpitiya", "place": "Alankuda Beach", "description": "North western coast of Sri Lanka as a point for off-shore Whale Watching and Dolphin watching at Kalpitiya.In fact there are range of water sports as such sailing, wind surfing, kayaking, canoeing, kite surfing and snorkeling are being offering."},
{"town": "Ratnapura", "place": "Doovili Ella", "description": "Many secrets and wonders of nature lie hidden within the Sinharaja Forest Reserve. One such wonder is the Duvilli Ella; a beautiful waterfall discovered quite recently. Although its height has not yet been determined, it is estimated to be over 500 feet high. The flow rate of the waterfall is constant all year through, and the spray creates a misty halo around the area. The name ‘Duvilli’ means ‘fine dust’ –therefore we can assume that the natives compared the water spray to a dusty look and hence the waterfall was named Duvilli Ella.There are many indigenous plant and animal species to be found in this unspoiled environment surrounding the waterfall. It has retained its natural habitat due to its location, which is not easily accessible by motor vehicles. A number of smaller waterfalls, about 50 to 60 feet high, can be spotted on the path to Duvilli Ella, urging you on towards the vision of beauty ahead."},
{"town": "Kandy", "place": "Meemure", "description": "The distance from Colombo capital to Meemure is about 188 km. Meemure is one of the most remote villages in Sri Lanka with the only access via a 14 km (8.7 mi) trail from the town of Loolwatte. Lakegala mountain is in Meemure village. It is thought of the place wherever King Ravana raised the Dhadu Monara or Dhandu Monara. Meemure village owns an exceptional natural beauty. It is rich with natural Beauty and Traditional Sri Lankan styles. According to the legend stories of the village goes back to 5000 years Lakegala that settled near this village was belonged to king Ravana. Pyramid-shaped Lakegala was used by Ravana as a source of security energy and people believe there was a tunnel in Lakegala at the time of Rama - Ravana War Most people believe that Ravana's corpse Been placed in Lakegala. The Knuckles Creek System contains at least 25 species of freshwater fish with 8 endemic species and 7 nationally threatened fish species recorded. The Knuckles Forest area has a rich birdlife composition and has recorded over 130 species of birds. More than 10 migratory species of birds are also found here.The villagers build environmentally friendly homes using clay and 'Illuk', which lasts for 30 to 40 years. They mark their land boundary, using walls of quirts. This building wall technology can only be seen in any village in Sri Lanka.Meemure is approximately a 7-hour drive from Colombo, in an off road vehicle. Here is how you can go there; First go to Kandy city which is 116 km away from Colombo. Then Kandy-Mahiyangana Road (A26) towards to Mahiyangana. Turn to Left from Hunnasgiriya Junction which is 35 km away from Kandy. Then go towards the Loolwatte Village which is 15 km away from Hunnasgiriya Junction. Then from Loolwatte it is about another 15 km to the Meemure Village.you can use village public van it is a marvelous experience to have,to that you should be at Hunnasgiriya junction around 11 clock .hiring vehicles from Hunnasgiriya would be expensive than village vehicle.There is no cellular service available in the village,but a CDMA telephone service is available.December – February Scanty rains March – September Clear weather September – December Rain can be expected Weather Report (Rain fall is expected) Since January/May Lakegala is absolutely viewed from Estern ocean of Sri Lanka, ancient sailors used this lake gala as a land mark."},
{"town": "Galle", "place": "Hikkaduwa Beach", "description": "Hikkaduwa is one of the best surfing spots in Sri Lanka, offering a clear hot water base. The waves vary in size from 4 to 11 feet. Surfing in the Hikkaduwa area is fairly well known and gets the best surfing during its dry season, which is from November to March. There are 4 hotspots in Hikkaduwa. Scuba diving and diving in clear waters are a major past time along this stretch and is the most ecological way to see the colorful fish that dart around. The coral sanctuary along the coast of Hikkaduwa is a large shallow body of water surrounded by a reef, decorated with layers of multicolored corals, and is home to countless colorful fish. Off the beach there is a collection of small islets surrounded by beautiful coral formations. Many species of fish and large turtles are found here. There are more than four different shipwrecks for diving enthusiasts to explore as well as diving shops offering PADI courses and equipmentThere are so many hotels, shops, bars, restaurants and guest houses. The beaches are beautiful and wide and swimming is safe here, although the currents are stronger when it comes south of Hikkaduwa. The impressive coral reef lies just offshore and is still populated with exotic fish and sea turtles. Glass bottom boats are available for visitors who want to admire the wonders of deep while keeping their feet dry! After a short distance south of the center of the reef, it decreases and begins a wider sandy beach with good waves ideal for board surfing and body surfing. There are many shops selling masks, jewelry, jewelry, batik, antiques and etc. with several Buddhist temples, all of which add spices to life in Hikkaduwa."},
{"town": "Beruwala", "place": "Beruwala & Bentota", "description": "A lagoon set in the tropical greenery, River Bentara Ganga dotted with islets rich in birdlife. Rich tourist destination with lots of luxury resorts with spa facilities to meet clients' expectations for ayurvedic treatments and other health and beauty treatments.Not only relaxing here is a prominent place offer watersports including swimming, water skiing on the rivers or estuaries, snorkelling, scuba diving, wind surfing, parasailing and fishing."},
{"town": "Jaffna", "place": "Nilavara Bottomless Well", "description": "Nilavarai Well, anatural underground water well, considered to be bottomless has many legends adding to the mysteries that encircle it.According to legend, Seetha, wife of Rama, while on the return journey to India was overcome with thirst and as there was no water to be found, Rama had gallantly shot an arrow on to the earth creating a well.On the more factual shade the well provides fresh water to the area around and is a source of water for domestic and irrigational purposes. Two attempts by various scientific groups had failed to identify the bottom of this well or its water source while some believes it to be connected to the freshwater ponds in Ayiyakachchi and Keerimalei through an underground river.The surroundings of the well is scattered with the ruins of a Buddhist monastery yet to be excavated while some Buddha statues found from the vicinity could be found at the Jaffna museum"},
{"town": "Colombo", "place": "Dutch Hospital", "description": "Dutch Hospital one of old building located in heart of the Colombo city. It was use as a hospital in Dutch era. This buildings architecture belongs to Dutch colonial architecture seventeenth century.Now in this building have shopping malls and luxurious restaurants and food and beverage shops. Colombo Fort Café, Barefoot Ministry of Crabs, Heladiv Tea Club, Semondu, Ikoi, Tei, Taphouse are some of shops and restaurants in Colombo Dutch hospital.Colombo Dutch hospital located in front of the world trade centre and bank of Ceylon buildings."},
{"town": "Colombo", "place": "Beira Lake", "description": "The lake is surrounded by many large businesses in the city. It occupied approximately 165 hectares of land 100 years ago, and has been reduced to mere 65 hectares today due to various reasons. You can stroll through the quiet alleys under the shade of the trees, scull on the lake on a swan-boat, visit the water-temple on the lake, cross the bridge to the island of lovers, or you can have some juice or tea nearby restaurants or shops. The trails just around Lake Beira and even the sidewalks on the road level have been beautifully done-up for a while now. The place is very green. It is a beautiful space to walk. Swan boat ride You can get swan boat (swan shaped boat) and take a ride on the lake for 30 minute. You can watch flock of ducks or giant-beaked birds on your boat ride. There has a giant bridge and it step onto small beautiful island. This island filled with loads of flowers and trees. Seema Malaka (Water temple) is the famous place of Beira Lake. The temple is a wonderful place for mind relaxing and it gives peaceful environment for Beira lake.Beira lake located in front of the Gangarama temple. You can visit to beira Lake by bus or Tuk Tuk. From Pettah to Beira lake, prices Tuk Tuk – Rs. 180 Taxi – Rs. 280 Visit the lake during Vesak when it's lit up - the temple on the lake will especially look beautiful."},
{"town": "Gampaha", "place": "Hamilton Canal", "description": "Boat Riding , Photography, FilmingAn incident which led to the canal been baptized as the Hamilton’s folly or the fool’s canal.Contradictory to the popular belief Hamilton Canal was not a creation of the King of Kotte nor the Dutch but was a later addition by Garvin Hamilton, British Agent of Revenue and Commerce in 1802, who constructed a new canal to the east of the canals created by Sinhalese king and the Dutch.The canal was designed to connect the Dutch canal by a series of parallel canals and was designed to drain the already damaged Muturajawela but caused the opposite to occur as the high tide brought salinity not only from Negambo lagoon but also the Kelani river."},
{"town": "Ampara", "place": "Maduru Oya National Wildlife Park", "description": "Established under the Mahaweli development project as a catchment area of the Maduru Oya Reservoir and refuge for the herds of elephants, who were displaced by the irrigation project, Maduru Oya National Wildlife Park is rich in flora, fauna and cultural heritage.The park perimeters include five reservoirs Maduru Oya, Ulhitiya, Ratkinda, NDK reservoir, and Henanigala tank and are also fed by tributaries of Mahaweli and Maduru Oya rivers.The park’s main attractions are the elephants, which there are about 200, who call Maduru Oya home. The other members of the fauna include sloth bear, leopard, water buffalo, toque monkey, common langur, Jackal, fishing cat, wild boar, Indian Muntjac, spotted deer, sambar, porcupine, black napped hare, Indian Pangolian, European otter and Grey slender Loris.The park also boasts of a rich collection of birds including painted stork, white bellied sea eagle, grey pelican, great cormorant, Little cormorant, Sri Lanka jungle fowl, broad billed roller, common tailor bird, shama, black hooded oriole and the endemic red faced malkoha. The parks reservoirs are home to flocks of oriental darters, spot billed pelican, Asian open bill, black headed ibis and Eurasian spoon bills.In addition to its rich biological diversity the construction of Maduru Oya reservoir unearthed an ancient sluice on the old ruptured earthen bund of the Maduru Oya. The upper sluice was built in two phases; the first of which dates to before the 6th century BC while the lower sluice is believed to be built during the third to first century BC.Vedda people, the indigenous people of Sri Lanka, numbering less than a thousand people, lives in Kandeganwela, Kotatalawa, henanigala and Dambana maintaining a life of hunting and chenna cultivation.Things To Do: Wildlife, photography, bird watching, explore and camping"},
{"town": "Ratnapura", "place": "Budugala", "description": "Kaltota is situated between the Rathnapura Monaragala and Badulla districts. Administratively, it is owned by the Sabaragamuwa province. There is ample evidence that there was an ancient Kingdom at Kaltota. There was a Pandya king (believed to be King Wickremapandya of the 11th century) who had a son named ‘Kalathitha”. When the son got married the King allowed him to settle down and establish a Kingdom in the up country region. The prince had come to Kaltota at the river valley of ‘walawe’ to establish the Kingdom at Budugala and had ruled four years, thereafter. The area was named Kalathithapura. Later, the King of Anuradhapura invaded with an army to kill the prince and destroy his palace; who ultimately threw treasures like gems, gold, silver in to the river.Some believe that those treasures are still there, somewhere in the river bed. Budugala is a big center-place, considering the past and present religious background at Kaltota. This picturesque religious place is found amidst the forest and at the bottom of the Kuragala rock, while traveling towards Kaltota via Welipothayaya. When passing Diyavinna from Weligepola visitors can see rocky caves, stone pillars, stony steps and ruined buildings even today. Some believe that this place was named Budugala due to a Buduha statue, constructed upon a rock. However, no remnants of such a construction remain today.A few later constructions can be seen alongside the early cave temples. As there is a belief of a hidden treasure at this place, it is always attacked by treasure seekers. Budugala temple and the vicinity is an archeological reserved site. Kuragala mountain range is situated over the Budugala auspicious premises. The people believe that there was an underground tunnel system from Kuragala to Budugala."},
{"town": "Colombo", "place": "Colombo Lighthouse", "description": "The Lighthouse was built in 1952. Both tourists and locals come to this place to sit and relax in beautiful spot. From the light house, you can get nice panoramic view of sea and the harbor. This place is use by Sri Lanka Navy for traditional gun salutes. Its height is 12m (39ft) and also have four statues of lions.This place located at Galbokka Point south of the Port of Colombo or towards the harbor road (Chaithya road)."},
{"town": "Kurunegala", "place": "Ridee Viharaya", "description": "Ridi Vihara or the Silver Temple was built at the place where Silver ore was found, that was made used to build Ruwanweli Dageba at Anuradhapura by King Dutugemunu during his rein.Ridi Vihara is an important Raja Maha Vihara belonging to the Cultural Triangle. Historical Data on this Monastery complex is found in some Caves written in Brahmin Inscriptions.They dates back to the 2nd and 3rd Centuries BC. During the time of Arahath Mahinda, many Arahaths are believed to be resided in these caves which numbers around twenty five in the surrounding area of Ridi Vihara and Rambadagalla area. The caves had been prepared by cutting into the rock and donated by chieftains of the area to the Sangha. The Ridi Vihara temple was built later by King Dutugemunu and the details about the construction is mainly being known by the historical chronicle Mahavamsa and by other sources like Ridi Vihara Asna and also by legendThings To Do: Photography, Filming, Cycling, Pilgrimage, Educational, Description"},
{"town": "Nuwara Eliya", "place": "St. Clairs Falls", "description": "when you travel to Nuwara-eliya through the Talawakele road, this is the best spot to take a break and having tea or coffee, sure it will take down your weariness. Misty cold climate, greenish environment gives you to best feeling ever. This surround environment provides best backdrop picture. St. Clair’s waterfall always be a magnificent place to photographers, it always gives different amazing views.If you want to explore this beautiful environment you can go for a hike from first fall to next fall.This water fall 80 meters’ height and 50 meters in widthSt. Clair’s waterfall located in 5km west of the Talawakele town on the Hatton- Talawakele road in Nuwara-Eliya district. It is about 142km and it take around 4 and half hour."}
]